[Killed] BooleanLiteral
api/user/login/route.ts:36:22
     const body: LoginRequest = await req.json();
     const { uniqName, password } = body;
 
-    if (!uniqName || !password) {
+    if (!uniqName || password) {
       return NextResponse.json(
         { error: "Username and password required" },
killedBy: User API Tests POST /api/user/login should login successfully with valid credentials
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
api/user/login/route.ts:43:70
       );
     }
 
-    const existingUser: UserFromDB | null = await db.user.findUnique({
-      where: { uniqName },
-      select: {
-        id: true,
-        uniqName: true,
-        hashPassword: true,
-      },
-    });
+    const existingUser: UserFromDB | null = await db.user.findUnique({});
 
     if (!existingUser) {
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
api/user/login/route.ts:44:14
     }
 
     const existingUser: UserFromDB | null = await db.user.findUnique({
-      where: { uniqName },
+      where: {},
       select: {
         id: true,
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 500 to be 200 // Object.is equality

[Survived] BooleanLiteral
api/user/login/route.ts:47:19
       where: { uniqName },
       select: {
         id: true,
-        uniqName: true,
+        uniqName: false,
         hashPassword: true,
       },

[Killed] BooleanLiteral
api/user/login/route.ts:48:23
       select: {
         id: true,
         uniqName: true,
-        hashPassword: true,
+        hashPassword: false,
       },
     });
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
api/user/login/route.ts:52:24
       },
     });
 
-    if (!existingUser) {
-      return NextResponse.json({ error: "User not found" }, { status: 404 });
-    }
+    if (!existingUser) {}
 
     const isPasswordValid = await bcrypt.compare(
killedBy: User API Tests POST /api/user/login should return 404 when user is not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BooleanLiteral
api/user/login/route.ts:52:9
       },
     });
 
-    if (!existingUser) {
+    if (existingUser) {
       return NextResponse.json({ error: "User not found" }, { status: 404 });
     }
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
api/user/login/route.ts:60:9
       password,
       existingUser.hashPassword,
     );
-    if (!isPasswordValid) {
+    if (true) {
       return NextResponse.json({ error: "Invalid password" }, { status: 401 });
     }
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BlockStatement
api/user/login/route.ts:60:27
       password,
       existingUser.hashPassword,
     );
-    if (!isPasswordValid) {
-      return NextResponse.json({ error: "Invalid password" }, { status: 401 });
-    }
+    if (!isPasswordValid) {}
 
     if (!process.env.JWT_SECRET) {
killedBy: Auth Integration Flow should return 401 fail login password is wrong
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ObjectLiteral
api/user/login/route.ts:61:32
       existingUser.hashPassword,
     );
     if (!isPasswordValid) {
-      return NextResponse.json({ error: "Invalid password" }, { status: 401 });
+      return NextResponse.json({}, { status: 401 });
     }
 
killedBy: Auth Integration Flow should return 401 fail login password is wrong
statusReason: expected undefined to be 'Invalid password' // Object.is equality

[Killed] ObjectLiteral
api/user/login/route.ts:61:63
       existingUser.hashPassword,
     );
     if (!isPasswordValid) {
-      return NextResponse.json({ error: "Invalid password" }, { status: 401 });
+      return NextResponse.json({ error: "Invalid password" }, {});
     }
 
killedBy: User API Tests POST /api/user/login should return 401 when password is invalid
statusReason: expected 200 to be 401 // Object.is equality

[Killed] BlockStatement
api/user/login/route.ts:64:34
       return NextResponse.json({ error: "Invalid password" }, { status: 401 });
     }
 
-    if (!process.env.JWT_SECRET) {
-      console.error("JWT_SECRET is not defined in environment variables");
-      return NextResponse.json(
-        { error: "Server configuration error" },
-        { status: 500 },
-      );
-    }
+    if (!process.env.JWT_SECRET) {}
 
     const token = jwt.sign(
killedBy: User API Tests POST /api/user/login should return 500 when JWT_SECRET is not set
statusReason: expected 200 to be 500 // Object.is equality

[Killed] StringLiteral
api/user/login/route.ts:67:18
     if (!process.env.JWT_SECRET) {
       console.error("JWT_SECRET is not defined in environment variables");
       return NextResponse.json(
-        { error: "Server configuration error" },
+        { error: "" },
         { status: 500 },
       );
killedBy: User API Tests POST /api/user/login should return 500 when JWT_SECRET is not set
statusReason: expected '' to be 'Server configuration error' // Object.is equality

[Killed] ObjectLiteral
api/user/login/route.ts:75:7
     const token = jwt.sign(
       { userId: existingUser.id, uniqName: existingUser.uniqName },
       process.env.JWT_SECRET,
-      { expiresIn: "7d" },
+      {},
     );
 
killedBy: User API Tests POST /api/user/login should login successfully with valid credentials
statusReason: expected "vi.fn()" to be called with arguments: [ { userId: 1, …(1) }, …(2) ]

Received: 

  1st vi.fn() call:

@@ -2,9 +2,7 @@
    {

[Killed] StringLiteral
api/user/login/route.ts:75:20
     const token = jwt.sign(
       { userId: existingUser.id, uniqName: existingUser.uniqName },
       process.env.JWT_SECRET,
-      { expiresIn: "7d" },
+      { expiresIn: "" },
     );
 
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
api/user/login/route.ts:79:7
     );
 
     const response = NextResponse.json<LoginResponse>(
-      {
-        message: "Login successful",
-        user: {
-          id: existingUser.id,
-          uniqName: existingUser.uniqName,
-        },
-      },
+      {},
       { status: 200 },
     );
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected undefined to be defined

[Killed] StringLiteral
api/user/login/route.ts:80:18
 
     const response = NextResponse.json<LoginResponse>(
       {
-        message: "Login successful",
+        message: "",
         user: {
           id: existingUser.id,
killedBy: User API Tests POST /api/user/login should login successfully with valid credentials
statusReason: expected { message: '', user: { id: 1, …(1) } } to deeply equal { message: 'Login successful', …(1) }

[Survived] BooleanLiteral
api/user/login/route.ts:90:17
     );
 
     response.cookies.set("token", token, {
-      httpOnly: true,
+      httpOnly: false,
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",

[Survived] ArithmeticOperator
api/user/login/route.ts:94:15
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",
       path: "/",
-      maxAge: 60 * 60 * 24 * 7,
+      maxAge: 60 * 60 * 24 / 7,
     });
 

[Survived] ArithmeticOperator
api/user/login/route.ts:94:15
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",
       path: "/",
-      maxAge: 60 * 60 * 24 * 7,
+      maxAge: 60 * 60 / 24 * 7,
     });
 

[Killed] BlockStatement
api/user/login/route.ts:98:19
     });
 
     return response;
-  } catch (error) {
-    console.error("Login error:", error);
-    return NextResponse.json(
-      { error: "Internal server error" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: User API Tests POST /api/user/login should handle server errors
statusReason: Cannot read properties of undefined (reading 'json')
