[Killed] BlockStatement
files/upload/[uuid]/route.ts:36:32
     const { uuid: folderUuidParam } = await context.params;
 
     let folderUuid: string | null = folderUuidParam;
-    if (folderUuid === "home") {
-      folderUuid = null;
-    }
+    if (folderUuid === "home") {}
 
     if (folderUuid !== null) {
killedBy: Upload API Integration Flow should return 400 when no file is sent
statusReason: expected 404 to be 400 // Object.is equality
