[NoCoverage] LogicalOperator
files/download/[uuid]/route.ts:6:22
 import { minioClient } from "@/lib/minio";
 import { db } from "@/lib/db";
 
-const FILES_BUCKET = process.env.FILES_BUCKET || "files";
+const FILES_BUCKET = process.env.FILES_BUCKET && "files";
 
 interface FileDownloadResponse {

[NoCoverage] ConditionalExpression
files/download/[uuid]/route.ts:6:22
 import { minioClient } from "@/lib/minio";
 import { db } from "@/lib/db";
 
-const FILES_BUCKET = process.env.FILES_BUCKET || "files";
+const FILES_BUCKET = false;
 
 interface FileDownloadResponse {

[NoCoverage] OptionalChaining
files/download/[uuid]/route.ts:22:20
 ): Promise<NextResponse<FileDownloadResponse> | NextResponse> {
   try {
     const user = await getUserFromToken();
-    const userId = user?.userId;
+    const userId = user.userId;
 
     const { uuid } = await context.params;

[NoCoverage] ConditionalExpression
files/download/[uuid]/route.ts:25:9
     const userId = user?.userId;
 
     const { uuid } = await context.params;
-    if (!uuid)
+    if (false)
       return NextResponse.json({ error: "UUID is required" }, { status: 400 });
 

[NoCoverage] BooleanLiteral
files/download/[uuid]/route.ts:25:9
     const userId = user?.userId;
 
     const { uuid } = await context.params;
-    if (!uuid)
+    if (uuid)
       return NextResponse.json({ error: "UUID is required" }, { status: 400 });
 

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:26:32
 
     const { uuid } = await context.params;
     if (!uuid)
-      return NextResponse.json({ error: "UUID is required" }, { status: 400 });
+      return NextResponse.json({}, { status: 400 });
 
     const file = await db.files.findUnique({

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:28:44
     if (!uuid)
       return NextResponse.json({ error: "UUID is required" }, { status: 400 });
 
-    const file = await db.files.findUnique({
-      where: { uuid },
-      select: {
-        name: true,
-        ownerId: true,
-        private: true,
-      },
-    });
+    const file = await db.files.findUnique({});
     if (!file)
       return NextResponse.json({ error: "File not found" }, { status: 404 });

[NoCoverage] BooleanLiteral
files/download/[uuid]/route.ts:32:18
       where: { uuid },
       select: {
         name: true,
-        ownerId: true,
+        ownerId: false,
         private: true,
       },

[NoCoverage] BooleanLiteral
files/download/[uuid]/route.ts:33:18
       select: {
         name: true,
         ownerId: true,
-        private: true,
+        private: false,
       },
     });

[NoCoverage] BooleanLiteral
files/download/[uuid]/route.ts:36:9
         private: true,
       },
     });
-    if (!file)
+    if (file)
       return NextResponse.json({ error: "File not found" }, { status: 404 });
 

[NoCoverage] ConditionalExpression
files/download/[uuid]/route.ts:36:9
         private: true,
       },
     });
-    if (!file)
+    if (false)
       return NextResponse.json({ error: "File not found" }, { status: 404 });
 

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:37:61
       },
     });
     if (!file)
-      return NextResponse.json({ error: "File not found" }, { status: 404 });
+      return NextResponse.json({ error: "File not found" }, {});
 
     if (file.private && file.ownerId !== userId)

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:37:32
       },
     });
     if (!file)
-      return NextResponse.json({ error: "File not found" }, { status: 404 });
+      return NextResponse.json({}, { status: 404 });
 
     if (file.private && file.ownerId !== userId)

[NoCoverage] LogicalOperator
files/download/[uuid]/route.ts:39:9
     if (!file)
       return NextResponse.json({ error: "File not found" }, { status: 404 });
 
-    if (file.private && file.ownerId !== userId)
+    if (file.private || file.ownerId !== userId)
       return NextResponse.json({ error: "Access denied" }, { status: 403 });
 

[NoCoverage] EqualityOperator
files/download/[uuid]/route.ts:39:25
     if (!file)
       return NextResponse.json({ error: "File not found" }, { status: 404 });
 
-    if (file.private && file.ownerId !== userId)
+    if (file.private && file.ownerId === userId)
       return NextResponse.json({ error: "Access denied" }, { status: 403 });
 

[NoCoverage] BlockStatement
files/download/[uuid]/route.ts:44:39
 
     const stream = await minioClient.getObject(FILES_BUCKET, uuid);
     const chunks: Uint8Array[] = [];
-    for await (const chunk of stream) {
-      chunks.push(chunk as Uint8Array);
-    }
+    for await (const chunk of stream) {}
 
     const buffer = Buffer.concat(chunks);

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:53:16
 
     return new NextResponse(buffer, {
       status: 200,
-      headers: {
-        "Content-Type": "application/octet-stream",
-        "Content-Length": buffer.length.toString(),
-        "Content-Disposition": `attachment; filename="${fileName}"`,
-      },
+      headers: {},
     });
   } catch (error) {

[NoCoverage] BlockStatement
files/download/[uuid]/route.ts:59:19
         "Content-Disposition": `attachment; filename="${fileName}"`,
       },
     });
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { error: "File download failed" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
files/download/[uuid]/route.ts:62:16
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { error: "File download failed" },
+      { error: "" },
       { status: 500 },
     );

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:62:7
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { error: "File download failed" },
+      {},
       { status: 500 },
     );

[NoCoverage] ObjectLiteral
files/download/[uuid]/route.ts:63:7
     console.error(error);
     return NextResponse.json(
       { error: "File download failed" },
-      { status: 500 },
+      {},
     );
   }
