[NoCoverage] BlockStatement
files/getList/[uuid]/route.ts:45:18
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId) {
-      return NextResponse.json(
-        { success: false, error: "Unauthorized" },
-        { status: 401 },
-      );
-    }
+    if (!userId) {}
 
     const { uuid } = await context.params;

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:47:20
 
     if (!userId) {
       return NextResponse.json(
-        { success: false, error: "Unauthorized" },
+        { success: true, error: "Unauthorized" },
         { status: 401 },
       );

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:47:9
 
     if (!userId) {
       return NextResponse.json(
-        { success: false, error: "Unauthorized" },
+        {},
         { status: 401 },
       );

[NoCoverage] ConditionalExpression
files/getList/[uuid]/route.ts:53:24
     }
 
     const { uuid } = await context.params;
-    const folderUuid = uuid === "home" ? null : uuid;
+    const folderUuid = true ? null : uuid;
 
     const files = await db.files.findMany({

[NoCoverage] EqualityOperator
files/getList/[uuid]/route.ts:53:24
     }
 
     const { uuid } = await context.params;
-    const folderUuid = uuid === "home" ? null : uuid;
+    const folderUuid = uuid !== "home" ? null : uuid;
 
     const files = await db.files.findMany({

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:56:14
     const folderUuid = uuid === "home" ? null : uuid;
 
     const files = await db.files.findMany({
-      where: { ownerId: userId, folderUuid },
+      where: {},
       select: {
         uuid: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:58:15
     const files = await db.files.findMany({
       where: { ownerId: userId, folderUuid },
       select: {
-        uuid: true,
+        uuid: false,
         name: true,
         type: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:59:15
       where: { ownerId: userId, folderUuid },
       select: {
         uuid: true,
-        name: true,
+        name: false,
         type: true,
         size: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:60:15
       select: {
         uuid: true,
         name: true,
-        type: true,
+        type: false,
         size: true,
         private: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:61:15
         uuid: true,
         name: true,
         type: true,
-        size: true,
+        size: false,
         private: true,
         createdAt: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:62:18
         name: true,
         type: true,
         size: true,
-        private: true,
+        private: false,
         createdAt: true,
         folder: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:63:20
         type: true,
         size: true,
         private: true,
-        createdAt: true,
+        createdAt: false,
         folder: true,
       },

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:64:17
         size: true,
         private: true,
         createdAt: true,
-        folder: true,
+        folder: false,
       },
     });

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:69:14
     });
 
     const folders = await db.folder.findMany({
-      where: { ownerId: userId, parentUuid: folderUuid },
+      where: {},
       select: {
         uuid: true,

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:70:15
 
     const folders = await db.folder.findMany({
       where: { ownerId: userId, parentUuid: folderUuid },
-      select: {
-        uuid: true,
-        name: true,
-        private: true,
-        createdAt: true,
-        size: true,
-      },
+      select: {},
     });
 

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:73:18
       select: {
         uuid: true,
         name: true,
-        private: true,
+        private: false,
         createdAt: true,
         size: true,

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:75:15
         name: true,
         private: true,
         createdAt: true,
-        size: true,
+        size: false,
       },
     });

[NoCoverage] ArrowFunction
files/getList/[uuid]/route.ts:79:54
       },
     });
 
-    const parsedFolders: FolderEntry[] = folders.map((f) => ({
-      uuid: f.uuid,
-      name: f.name,
-      size: f.size,
-      privacy: f.private,
-      date: f.createdAt.getTime(),
-    }));
+    const parsedFolders: FolderEntry[] = folders.map(() => undefined);
 
     const parsedFiles: FileEntry[] = files.map((f) => ({

[NoCoverage] ArrowFunction
files/getList/[uuid]/route.ts:87:48
       date: f.createdAt.getTime(),
     }));
 
-    const parsedFiles: FileEntry[] = files.map((f) => ({
-      folder: f.folder,
-      uuid: f.uuid,
-      type: f.type,
-      name: f.name,
-      size: f.size,
-      privacy: f.private,
-      date: f.createdAt.getTime(),
-    }));
+    const parsedFiles: FileEntry[] = files.map(() => undefined);
 
     return NextResponse.json(

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:87:56
       date: f.createdAt.getTime(),
     }));
 
-    const parsedFiles: FileEntry[] = files.map((f) => ({
-      folder: f.folder,
-      uuid: f.uuid,
-      type: f.type,
-      name: f.name,
-      size: f.size,
-      privacy: f.private,
-      date: f.createdAt.getTime(),
-    }));
+    const parsedFiles: FileEntry[] = files.map((f) => ({}));
 
     return NextResponse.json(

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:98:7
     }));
 
     return NextResponse.json(
-      {
-        success: true,
-        message: "Files loaded successfully",
-        files: parsedFiles,
-        folders: parsedFolders,
-      },
+      {},
       { status: 200 },
     );

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:99:18
 
     return NextResponse.json(
       {
-        success: true,
+        success: false,
         message: "Files loaded successfully",
         files: parsedFiles,

[NoCoverage] ObjectLiteral
files/getList/[uuid]/route.ts:104:7
         files: parsedFiles,
         folders: parsedFolders,
       },
-      { status: 200 },
+      {},
     );
   } catch (error) {

[NoCoverage] BlockStatement
files/getList/[uuid]/route.ts:106:19
       },
       { status: 200 },
     );
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "Server error" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
files/getList/[uuid]/route.ts:109:18
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Server error" },
+      { success: true, error: "Server error" },
       { status: 500 },
     );

[NoCoverage] StringLiteral
files/getList/[uuid]/route.ts:109:32
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Server error" },
+      { success: false, error: "" },
       { status: 500 },
     );
