[NoCoverage] ConditionalExpression
files/preview/[uuid]/route.ts:6:22
 import { minioClient } from "@/lib/minio";
 import { db } from "@/lib/db";
 
-const FILES_BUCKET = process.env.FILES_BUCKET || "files";
+const FILES_BUCKET = true;
 const EXPIRY_SECONDS = 60 * 5;
 

[NoCoverage] ArithmeticOperator
files/preview/[uuid]/route.ts:7:24
 import { db } from "@/lib/db";
 
 const FILES_BUCKET = process.env.FILES_BUCKET || "files";
-const EXPIRY_SECONDS = 60 * 5;
+const EXPIRY_SECONDS = 60 / 5;
 
 const ALLOWED_MIME_TYPES = [

[NoCoverage] ArrayDeclaration
files/preview/[uuid]/route.ts:9:28
 const FILES_BUCKET = process.env.FILES_BUCKET || "files";
 const EXPIRY_SECONDS = 60 * 5;
 
-const ALLOWED_MIME_TYPES = [
-  "image/jpeg",
-  "image/png",
-  "image/gif",
-  "image/svg+xml",
-  "application/pdf",
-  "text/plain",
-  "video/mp4",
-  "audio/mpeg",
-];
+const ALLOWED_MIME_TYPES = [];
 
 interface FilePreviewResponse {

[NoCoverage] StringLiteral
files/preview/[uuid]/route.ts:11:3
 
 const ALLOWED_MIME_TYPES = [
   "image/jpeg",
-  "image/png",
+  "",
   "image/gif",
   "image/svg+xml",

[NoCoverage] StringLiteral
files/preview/[uuid]/route.ts:12:3
 const ALLOWED_MIME_TYPES = [
   "image/jpeg",
   "image/png",
-  "image/gif",
+  "",
   "image/svg+xml",
   "application/pdf",

[NoCoverage] StringLiteral
files/preview/[uuid]/route.ts:13:3
   "image/jpeg",
   "image/png",
   "image/gif",
-  "image/svg+xml",
+  "",
   "application/pdf",
   "text/plain",

[NoCoverage] StringLiteral
files/preview/[uuid]/route.ts:15:3
   "image/gif",
   "image/svg+xml",
   "application/pdf",
-  "text/plain",
+  "",
   "video/mp4",
   "audio/mpeg",

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:47:9
     if (!userId) {
       return NextResponse.json(
         { success: false, error: "Unauthorized" },
-        { status: 401 },
+        {},
       );
     }

[NoCoverage] BlockStatement
files/preview/[uuid]/route.ts:53:16
 
     const { uuid } = await context.params;
 
-    if (!uuid) {
-      return NextResponse.json(
-        { success: false, error: "UUID is required" },
-        { status: 400 },
-      );
-    }
+    if (!uuid) {}
 
     const file = await db.files.findUnique({

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:53:9
 
     const { uuid } = await context.params;
 
-    if (!uuid) {
+    if (uuid) {
       return NextResponse.json(
         { success: false, error: "UUID is required" },

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:55:20
 
     if (!uuid) {
       return NextResponse.json(
-        { success: false, error: "UUID is required" },
+        { success: true, error: "UUID is required" },
         { status: 400 },
       );

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:55:9
 
     if (!uuid) {
       return NextResponse.json(
-        { success: false, error: "UUID is required" },
+        {},
         { status: 400 },
       );

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:56:9
     if (!uuid) {
       return NextResponse.json(
         { success: false, error: "UUID is required" },
-        { status: 400 },
+        {},
       );
     }

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:61:14
     }
 
     const file = await db.files.findUnique({
-      where: { uuid },
+      where: {},
       select: {
         ownerId: true,

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:62:15
 
     const file = await db.files.findUnique({
       where: { uuid },
-      select: {
-        ownerId: true,
-        private: true,
-        type: true,
-      },
+      select: {},
     });
 

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:63:18
     const file = await db.files.findUnique({
       where: { uuid },
       select: {
-        ownerId: true,
+        ownerId: false,
         private: true,
         type: true,

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:65:15
       select: {
         ownerId: true,
         private: true,
-        type: true,
+        type: false,
       },
     });

[NoCoverage] ConditionalExpression
files/preview/[uuid]/route.ts:69:9
       },
     });
 
-    if (!file) {
+    if (true) {
       return NextResponse.json(
         { success: false, error: "File not found" },

[NoCoverage] BlockStatement
files/preview/[uuid]/route.ts:69:16
       },
     });
 
-    if (!file) {
-      return NextResponse.json(
-        { success: false, error: "File not found" },
-        { status: 404 },
-      );
-    }
+    if (!file) {}
 
     if (file.private && file.ownerId !== userId) {

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:71:20
 
     if (!file) {
       return NextResponse.json(
-        { success: false, error: "File not found" },
+        { success: true, error: "File not found" },
         { status: 404 },
       );

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:71:9
 
     if (!file) {
       return NextResponse.json(
-        { success: false, error: "File not found" },
+        {},
         { status: 404 },
       );

[NoCoverage] ConditionalExpression
files/preview/[uuid]/route.ts:76:9
       );
     }
 
-    if (file.private && file.ownerId !== userId) {
+    if (true) {
       return NextResponse.json(
         { success: false, error: "Access denied" },

[NoCoverage] BlockStatement
files/preview/[uuid]/route.ts:76:50
       );
     }
 
-    if (file.private && file.ownerId !== userId) {
-      return NextResponse.json(
-        { success: false, error: "Access denied" },
-        { status: 403 },
-      );
-    }
+    if (file.private && file.ownerId !== userId) {}
 
     const fileMimeType = file.type?.toLowerCase();

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:78:20
 
     if (file.private && file.ownerId !== userId) {
       return NextResponse.json(
-        { success: false, error: "Access denied" },
+        { success: true, error: "Access denied" },
         { status: 403 },
       );

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:78:9
 
     if (file.private && file.ownerId !== userId) {
       return NextResponse.json(
-        { success: false, error: "Access denied" },
+        {},
         { status: 403 },
       );

[NoCoverage] OptionalChaining
files/preview/[uuid]/route.ts:83:26
       );
     }
 
-    const fileMimeType = file.type?.toLowerCase();
+    const fileMimeType = file.type.toLowerCase();
 
     if (!fileMimeType || !ALLOWED_MIME_TYPES.includes(fileMimeType)) {

[NoCoverage] MethodExpression
files/preview/[uuid]/route.ts:83:26
       );
     }
 
-    const fileMimeType = file.type?.toLowerCase();
+    const fileMimeType = file.type?.toUpperCase();
 
     if (!fileMimeType || !ALLOWED_MIME_TYPES.includes(fileMimeType)) {

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:85:26
 
     const fileMimeType = file.type?.toLowerCase();
 
-    if (!fileMimeType || !ALLOWED_MIME_TYPES.includes(fileMimeType)) {
+    if (!fileMimeType || ALLOWED_MIME_TYPES.includes(fileMimeType)) {
       return NextResponse.json(
         {

[NoCoverage] LogicalOperator
files/preview/[uuid]/route.ts:85:9
 
     const fileMimeType = file.type?.toLowerCase();
 
-    if (!fileMimeType || !ALLOWED_MIME_TYPES.includes(fileMimeType)) {
+    if (!fileMimeType && !ALLOWED_MIME_TYPES.includes(fileMimeType)) {
       return NextResponse.json(
         {

[NoCoverage] ObjectLiteral
files/preview/[uuid]/route.ts:87:9
 
     if (!fileMimeType || !ALLOWED_MIME_TYPES.includes(fileMimeType)) {
       return NextResponse.json(
-        {
-          success: false,
-          error: `Preview is not available for this file type: ${fileMimeType}`,
-        },
+        {},
         { status: 400 },
       );

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:102:18
     );
 
     return NextResponse.json(
-      { success: true, url: presignedUrl },
+      { success: false, url: presignedUrl },
       { status: 200 },
     );

[NoCoverage] BlockStatement
files/preview/[uuid]/route.ts:105:19
       { success: true, url: presignedUrl },
       { status: 200 },
     );
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "Failed to generate preview URL" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
files/preview/[uuid]/route.ts:108:18
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Failed to generate preview URL" },
+      { success: true, error: "Failed to generate preview URL" },
       { status: 500 },
     );

[NoCoverage] StringLiteral
files/preview/[uuid]/route.ts:108:32
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Failed to generate preview URL" },
+      { success: false, error: "" },
       { status: 500 },
     );
