[NoCoverage] ConditionalExpression
files/remove/[uuid]/route.ts:24:9
   try {
     const user = await getUserFromToken();
     const userId = user?.userId;
-    if (!userId)
+    if (true)
       return NextResponse.json(
         { success: false, error: "Unauthorized" },

[NoCoverage] ConditionalExpression
files/remove/[uuid]/route.ts:24:9
   try {
     const user = await getUserFromToken();
     const userId = user?.userId;
-    if (!userId)
+    if (false)
       return NextResponse.json(
         { success: false, error: "Unauthorized" },

[NoCoverage] ConditionalExpression
files/remove/[uuid]/route.ts:31:9
       );
 
     const { uuid } = await context.params;
-    if (!uuid)
+    if (true)
       return NextResponse.json(
         { success: false, error: "UUID is required" },

[NoCoverage] BooleanLiteral
files/remove/[uuid]/route.ts:39:26
 
     const file = await db.files.findUnique({
       where: { uuid },
-      select: { ownerId: true },
+      select: { ownerId: false },
     });
     if (!file)

[NoCoverage] ConditionalExpression
files/remove/[uuid]/route.ts:46:9
         { success: false, error: "File not found" },
         { status: 404 },
       );
-    if (file.ownerId !== userId)
+    if (false)
       return NextResponse.json(
         { success: false, error: "Access denied" },

[NoCoverage] EqualityOperator
files/remove/[uuid]/route.ts:46:9
         { success: false, error: "File not found" },
         { status: 404 },
       );
-    if (file.ownerId !== userId)
+    if (file.ownerId === userId)
       return NextResponse.json(
         { success: false, error: "Access denied" },

[NoCoverage] StringLiteral
files/remove/[uuid]/route.ts:48:34
       );
     if (file.ownerId !== userId)
       return NextResponse.json(
-        { success: false, error: "Access denied" },
+        { success: false, error: "" },
         { status: 403 },
       );

[NoCoverage] BlockStatement
files/remove/[uuid]/route.ts:52:9
         { status: 403 },
       );
 
-    try {
-      await minioClient.removeObject(FILES_BUCKET, uuid);
-    } catch {
+    try {} catch {
       console.error("MinIO remove error:");
     }

[NoCoverage] BlockStatement
files/remove/[uuid]/route.ts:54:13
 
     try {
       await minioClient.removeObject(FILES_BUCKET, uuid);
-    } catch {
-      console.error("MinIO remove error:");
-    }
+    } catch {}
 
     await db.files.delete({ where: { uuid } });

[NoCoverage] BooleanLiteral
files/remove/[uuid]/route.ts:60:41
 
     await db.files.delete({ where: { uuid } });
 
-    return NextResponse.json({ success: true, error: null }, { status: 200 });
+    return NextResponse.json({ success: false, error: null }, { status: 200 });
   } catch (error) {
     console.error(error);

[NoCoverage] BlockStatement
files/remove/[uuid]/route.ts:61:19
     await db.files.delete({ where: { uuid } });
 
     return NextResponse.json({ success: true, error: null }, { status: 200 });
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "File delete failed" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
files/remove/[uuid]/route.ts:64:18
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "File delete failed" },
+      { success: true, error: "File delete failed" },
       { status: 500 },
     );
