[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:23:9
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId)
+    if (true)
       return NextResponse.json(
         { success: false, error: "Unauthorized" },

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:23:9
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId)
+    if (false)
       return NextResponse.json(
         { success: false, error: "Unauthorized" },

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:31:9
 
     const { uuid, privacy } = await context.params;
 
-    if (!uuid)
+    if (false)
       return NextResponse.json(
         { success: false, error: "UUID is required" },

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:31:9
 
     const { uuid, privacy } = await context.params;
 
-    if (!uuid)
+    if (true)
       return NextResponse.json(
         { success: false, error: "UUID is required" },

[NoCoverage] EqualityOperator
update-privacy/[uuid]/[privacy]/route.ts:37:23
         { status: 400 },
       );
 
-    const isPrivate = privacy !== "1";
+    const isPrivate = privacy === "1";
 
     const file = await db.files.findUnique({

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:37:23
         { status: 400 },
       );
 
-    const isPrivate = privacy !== "1";
+    const isPrivate = true;
 
     const file = await db.files.findUnique({

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:44:9
       select: { ownerId: true },
     });
 
-    if (!file)
+    if (true)
       return NextResponse.json(
         { success: false, error: "File not found" },

[NoCoverage] BooleanLiteral
update-privacy/[uuid]/[privacy]/route.ts:44:9
       select: { ownerId: true },
     });
 
-    if (!file)
+    if (file)
       return NextResponse.json(
         { success: false, error: "File not found" },

[NoCoverage] StringLiteral
update-privacy/[uuid]/[privacy]/route.ts:46:34
 
     if (!file)
       return NextResponse.json(
-        { success: false, error: "File not found" },
+        { success: false, error: "" },
         { status: 404 },
       );

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:50:9
         { status: 404 },
       );
 
-    if (file.ownerId !== userId)
+    if (false)
       return NextResponse.json(
         { success: false, error: "Access denied" },

[NoCoverage] EqualityOperator
update-privacy/[uuid]/[privacy]/route.ts:50:9
         { status: 404 },
       );
 
-    if (file.ownerId !== userId)
+    if (file.ownerId === userId)
       return NextResponse.json(
         { success: false, error: "Access denied" },

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:53:9
     if (file.ownerId !== userId)
       return NextResponse.json(
         { success: false, error: "Access denied" },
-        { status: 403 },
+        {},
       );
 

[NoCoverage] BlockStatement
update-privacy/[uuid]/[privacy]/route.ts:62:19
     });
 
     return NextResponse.json({ success: true, error: null }, { status: 200 });
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "Internal server error" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
update-privacy/[uuid]/[privacy]/route.ts:65:18
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Internal server error" },
+      { success: true, error: "Internal server error" },
       { status: 500 },
     );

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:65:7
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Internal server error" },
+      {},
       { status: 500 },
     );
