[Killed] ConditionalExpression
files/upload/[uuid]/route.ts:36:9
     const { uuid: folderUuidParam } = await context.params;
 
     let folderUuid: string | null = folderUuidParam;
-    if (folderUuid === "home") {
+    if (true) {
       folderUuid = null;
     }
killedBy: Upload API Integration Flow should successfully upload a file to the user's own folder
statusReason: expected null to be '8f4be6cd-53fb-49c5-aaa9-c11914674eb4' // Object.is equality

[Killed] EqualityOperator
files/upload/[uuid]/route.ts:36:9
     const { uuid: folderUuidParam } = await context.params;
 
     let folderUuid: string | null = folderUuidParam;
-    if (folderUuid === "home") {
+    if (folderUuid !== "home") {
       folderUuid = null;
     }
killedBy: Upload API Integration Flow should return 400 when no file is sent
statusReason: expected 404 to be 400 // Object.is equality

[Killed] ConditionalExpression
files/upload/[uuid]/route.ts:40:9
       folderUuid = null;
     }
 
-    if (folderUuid !== null) {
+    if (false) {
       const folder = await db.folder.findUnique({
         where: {
killedBy: Upload API Integration Flow should return 404 when trying to upload to someone else's folder
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
files/upload/[uuid]/route.ts:40:30
       folderUuid = null;
     }
 
-    if (folderUuid !== null) {
-      const folder = await db.folder.findUnique({
-        where: {
-          uuid: folderUuid,
-          ownerId: userId,
-        },
-      });
-
-      if (!folder)
-        return NextResponse.json(
-          { success: false, error: "Folder not found" },
-          { status: 404 },
-        );
-    }
+    if (folderUuid !== null) {}
 
     const formData = await request.formData();
killedBy: Upload API Integration Flow should return 404 when trying to upload to someone else's folder
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
files/upload/[uuid]/route.ts:48:11
         },
       });
 
-      if (!folder)
+      if (true)
         return NextResponse.json(
           { success: false, error: "Folder not found" },
killedBy: Upload API Integration Flow should successfully upload a file to the user's own folder
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
files/upload/[uuid]/route.ts:48:11
         },
       });
 
-      if (!folder)
+      if (false)
         return NextResponse.json(
           { success: false, error: "Folder not found" },
killedBy: Upload API Integration Flow should return 404 when trying to upload to someone else's folder
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
files/upload/[uuid]/route.ts:50:22
 
       if (!folder)
         return NextResponse.json(
-          { success: false, error: "Folder not found" },
+          { success: true, error: "Folder not found" },
           { status: 404 },
         );
killedBy: Upload API Integration Flow should return 404 when trying to upload to someone else's folder
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
files/upload/[uuid]/route.ts:51:11
       if (!folder)
         return NextResponse.json(
           { success: false, error: "Folder not found" },
-          { status: 404 },
+          {},
         );
     }
killedBy: Upload API Integration Flow should return 404 when trying to upload to someone else's folder
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
files/upload/[uuid]/route.ts:58:9
     const formData = await request.formData();
     const file = formData.get("file") as File | null;
 
-    if (!file)
+    if (false)
       return NextResponse.json(
         { success: false, error: "No file provided" },
killedBy: Upload API Integration Flow should return 400 when no file is sent
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BooleanLiteral
files/upload/[uuid]/route.ts:60:20
 
     if (!file)
       return NextResponse.json(
-        { success: false, error: "No file provided" },
+        { success: true, error: "No file provided" },
         { status: 400 },
       );
killedBy: Upload API Integration Flow should return 400 when no file is sent
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
files/upload/[uuid]/route.ts:60:34
 
     if (!file)
       return NextResponse.json(
-        { success: false, error: "No file provided" },
+        { success: false, error: "" },
         { status: 400 },
       );

[Killed] ObjectLiteral
files/upload/[uuid]/route.ts:72:13
     });
 
     const newFile = await db.files.create({
-      data: {
-        folderUuid,
-        name: file.name,
-        uuid,
-        size: file.size,
-        type: file.type,
-        ownerId: userId,
-      },
+      data: {},
     });
 
killedBy: Upload API Integration Flow should successfully upload a file to the home folder (folderUuid = null)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
files/upload/[uuid]/route.ts:83:18
     });
 
     return NextResponse.json(
-      { success: true, error: null, uuid: newFile.uuid },
+      { success: false, error: null, uuid: newFile.uuid },
       { status: 200 },
     );
killedBy: Upload API Integration Flow should successfully upload a file to the home folder (folderUuid = null)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
files/upload/[uuid]/route.ts:83:7
     });
 
     return NextResponse.json(
-      { success: true, error: null, uuid: newFile.uuid },
+      {},
       { status: 200 },
     );
killedBy: Upload API Integration Flow should successfully upload a file to the home folder (folderUuid = null)
statusReason: expected undefined to be true // Object.is equality

[NoCoverage] BlockStatement
files/upload/[uuid]/route.ts:86:19
       { success: true, error: null, uuid: newFile.uuid },
       { status: 200 },
     );
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "Internal server error" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
