[NoCoverage] BooleanLiteral
folders/createFolder/[uuid]/route.ts:24:9
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId)
+    if (userId)
       return NextResponse.json(
         { success: false, error: "Unauthorized" },

[NoCoverage] ConditionalExpression
folders/createFolder/[uuid]/route.ts:33:9
     const { uuid: parentUuidParam } = await context.params;
 
     let parentUuid: string | null = parentUuidParam;
-    if (parentUuid === "home") {
+    if (false) {
       parentUuid = null;
     }

[NoCoverage] BlockStatement
folders/createFolder/[uuid]/route.ts:33:32
     const { uuid: parentUuidParam } = await context.params;
 
     let parentUuid: string | null = parentUuidParam;
-    if (parentUuid === "home") {
-      parentUuid = null;
-    }
+    if (parentUuid === "home") {}
 
     const body = await request.json();

[NoCoverage] MethodExpression
folders/createFolder/[uuid]/route.ts:38:24
     }
 
     const body = await request.json();
-    const folderName = body?.name?.trim();
+    const folderName = body?.name;
 
     if (!folderName)

[NoCoverage] OptionalChaining
folders/createFolder/[uuid]/route.ts:38:24
     }
 
     const body = await request.json();
-    const folderName = body?.name?.trim();
+    const folderName = body?.name.trim();
 
     if (!folderName)

[NoCoverage] BooleanLiteral
folders/createFolder/[uuid]/route.ts:40:9
     const body = await request.json();
     const folderName = body?.name?.trim();
 
-    if (!folderName)
+    if (folderName)
       return NextResponse.json(
         { success: false, error: "Folder name is required" },

[NoCoverage] ConditionalExpression
folders/createFolder/[uuid]/route.ts:40:9
     const body = await request.json();
     const folderName = body?.name?.trim();
 
-    if (!folderName)
+    if (true)
       return NextResponse.json(
         { success: false, error: "Folder name is required" },

[NoCoverage] BooleanLiteral
folders/createFolder/[uuid]/route.ts:42:20
 
     if (!folderName)
       return NextResponse.json(
-        { success: false, error: "Folder name is required" },
+        { success: true, error: "Folder name is required" },
         { status: 400 },
       );

[NoCoverage] ObjectLiteral
folders/createFolder/[uuid]/route.ts:48:28
 
     const uuid = uuidv4();
 
-    await db.folder.create({
-      data: {
-        uuid,
-        name: folderName,
-        size: 0,
-        ownerId: userId,
-        parentUuid,
-      },
-    });
+    await db.folder.create({});
 
     return NextResponse.json(

[NoCoverage] BooleanLiteral
folders/createFolder/[uuid]/route.ts:59:18
     });
 
     return NextResponse.json(
-      { success: true, error: null, uuid },
+      { success: false, error: null, uuid },
       { status: 200 },
     );

[NoCoverage] StringLiteral
folders/createFolder/[uuid]/route.ts:65:32
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Internal server error" },
+      { success: false, error: "" },
       { status: 500 },
     );

[NoCoverage] ObjectLiteral
folders/createFolder/[uuid]/route.ts:66:7
     console.error(error);
     return NextResponse.json(
       { success: false, error: "Internal server error" },
-      { status: 500 },
+      {},
     );
   }
