[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:35:44
 ): Promise<FolderItem[]> {
   const result: FolderItem[] = [];
 
-  const folders = await db.folder.findMany({
-    where: {
-      parentUuid: folderUuid,
-      ownerId: userId,
-    },
-    select: {
-      uuid: true,
-      name: true,
-      size: true,
-    },
-  });
+  const folders = await db.folder.findMany({});
 
   for (const folder of folders) {

[NoCoverage] BooleanLiteral
folders/download/[uuid]/route.ts:43:13
     select: {
       uuid: true,
       name: true,
-      size: true,
+      size: false,
     },
   });

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:47:33
     },
   });
 
-  for (const folder of folders) {
-    const folderPath = currentPath
-      ? `${currentPath}/${folder.name}`
-      : folder.name;
-    const folderItem: FolderItem = {
-      uuid: folder.uuid,
-      name: folder.name,
-      type: "folder",
-      path: folderPath,
-      size: folder.size,
-      children: await getFolderContents(folder.uuid, userId, folderPath),
-    };
-    result.push(folderItem);
-  }
+  for (const folder of folders) {}
 
   const files = await db.files.findMany({

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:49:9
 
   for (const folder of folders) {
     const folderPath = currentPath
-      ? `${currentPath}/${folder.name}`
+      ? ``
       : folder.name;
     const folderItem: FolderItem = {

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:63:12
   }
 
   const files = await db.files.findMany({
-    where: {
-      folderUuid,
-      ownerId: userId,
-    },
+    where: {},
     select: {
       uuid: true,

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:67:13
       folderUuid,
       ownerId: userId,
     },
-    select: {
-      uuid: true,
-      name: true,
-      size: true,
-    },
+    select: {},
   });
 

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:74:29
     },
   });
 
-  for (const file of files) {
-    const filePath = currentPath ? `${currentPath}/${file.name}` : file.name;
-    const fileItem: FolderItem = {
-      uuid: file.uuid,
-      name: file.name,
-      type: "file",
-      path: filePath,
-      size: file.size,
-    };
-    result.push(fileItem);
-  }
+  for (const file of files) {}
 
   return result;

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:92:18
 async function downloadFileToTemp(
   fileUuid: string,
   tempPath: string,
-): Promise<void> {
-  try {
-    const stream = await minioClient.getObject(FILES_BUCKET, fileUuid);
-    const writeStream = createWriteStream(tempPath);
-
-    await pipeline(stream, writeStream);
-  } catch (error) {
-    console.error(`Failed to download file ${fileUuid}:`, error);
-    throw error;
-  }
-}
+): Promise<void> {}
 
 async function createArchive(

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:93:7
   fileUuid: string,
   tempPath: string,
 ): Promise<void> {
-  try {
-    const stream = await minioClient.getObject(FILES_BUCKET, fileUuid);
-    const writeStream = createWriteStream(tempPath);
-
-    await pipeline(stream, writeStream);
-  } catch (error) {
+  try {} catch (error) {
     console.error(`Failed to download file ${fileUuid}:`, error);
     throw error;

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:98:19
     const writeStream = createWriteStream(tempPath);
 
     await pipeline(stream, writeStream);
-  } catch (error) {
-    console.error(`Failed to download file ${fileUuid}:`, error);
-    throw error;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:112:74
   const AdmZip = (await import("adm-zip")).default;
   const zip = new AdmZip();
 
-  const processItem = async (item: FolderItem, basePath: string = "") => {
-    const itemPath = basePath ? `${basePath}/${item.name}` : item.name;
-
-    if (item.type === "folder") {
-      zip.addFile(itemPath + "/", Buffer.alloc(0));
-
-      if (item.children && item.children.length > 0) {
-        for (const child of item.children) {
-          await processItem(child, itemPath);
-        }
-      }
-    } else {
-      const tempFilePath = path.join(tempDir, `temp_${item.uuid}`);
-
-      await downloadFileToTemp(item.uuid, tempFilePath);
-
-      const fileData = await fs.readFile(tempFilePath);
-      zip.addFile(itemPath, fileData);
-
-      await unlink(tempFilePath);
-    }
-  };
+  const processItem = async (item: FolderItem, basePath: string = "") => {};
 
   for (const item of contents) {

[NoCoverage] ConditionalExpression
folders/download/[uuid]/route.ts:115:9
   const processItem = async (item: FolderItem, basePath: string = "") => {
     const itemPath = basePath ? `${basePath}/${item.name}` : item.name;
 
-    if (item.type === "folder") {
+    if (true) {
       zip.addFile(itemPath + "/", Buffer.alloc(0));
 

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:115:33
   const processItem = async (item: FolderItem, basePath: string = "") => {
     const itemPath = basePath ? `${basePath}/${item.name}` : item.name;
 
-    if (item.type === "folder") {
-      zip.addFile(itemPath + "/", Buffer.alloc(0));
-
-      if (item.children && item.children.length > 0) {
-        for (const child of item.children) {
-          await processItem(child, itemPath);
-        }
-      }
-    } else {
+    if (item.type === "folder") {} else {
       const tempFilePath = path.join(tempDir, `temp_${item.uuid}`);
 

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:116:30
     const itemPath = basePath ? `${basePath}/${item.name}` : item.name;
 
     if (item.type === "folder") {
-      zip.addFile(itemPath + "/", Buffer.alloc(0));
+      zip.addFile(itemPath + "", Buffer.alloc(0));
 
       if (item.children && item.children.length > 0) {

[NoCoverage] ConditionalExpression
folders/download/[uuid]/route.ts:118:11
     if (item.type === "folder") {
       zip.addFile(itemPath + "/", Buffer.alloc(0));
 
-      if (item.children && item.children.length > 0) {
+      if (false) {
         for (const child of item.children) {
           await processItem(child, itemPath);

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:118:54
     if (item.type === "folder") {
       zip.addFile(itemPath + "/", Buffer.alloc(0));
 
-      if (item.children && item.children.length > 0) {
-        for (const child of item.children) {
-          await processItem(child, itemPath);
-        }
-      }
+      if (item.children && item.children.length > 0) {}
     } else {
       const tempFilePath = path.join(tempDir, `temp_${item.uuid}`);

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:119:44
       zip.addFile(itemPath + "/", Buffer.alloc(0));
 
       if (item.children && item.children.length > 0) {
-        for (const child of item.children) {
-          await processItem(child, itemPath);
-        }
+        for (const child of item.children) {}
       }
     } else {

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:123:12
           await processItem(child, itemPath);
         }
       }
-    } else {
-      const tempFilePath = path.join(tempDir, `temp_${item.uuid}`);
-
-      await downloadFileToTemp(item.uuid, tempFilePath);
-
-      const fileData = await fs.readFile(tempFilePath);
-      zip.addFile(itemPath, fileData);
-
-      await unlink(tempFilePath);
-    }
+    } else {}
   };
 

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:135:32
     }
   };
 
-  for (const item of contents) {
-    await processItem(item);
-  }
+  for (const item of contents) {}
 
   const archivePath = path.join(tempDir, "archive.zip");

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:139:42
     await processItem(item);
   }
 
-  const archivePath = path.join(tempDir, "archive.zip");
+  const archivePath = path.join(tempDir, "");
   zip.writeZip(archivePath);
 

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:144:10
 
   const stats = await fs.stat(archivePath);
 
-  return { archivePath, totalSize: stats.size };
+  return {};
 }
 

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:155:18
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId) {
-      return new NextResponse("Unauthorized", { status: 401 });
-    }
+    if (!userId) {}
 
     const { uuid: folderUuidParam } = await context.params;

[NoCoverage] ConditionalExpression
folders/download/[uuid]/route.ts:155:9
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId) {
+    if (true) {
       return new NextResponse("Unauthorized", { status: 401 });
     }

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:162:22
     const { uuid: folderUuidParam } = await context.params;
 
     let folderUuid: string | null = folderUuidParam;
-    let folderName = "files";
+    let folderName = "";
 
     if (folderUuid === "home") {

[NoCoverage] ConditionalExpression
folders/download/[uuid]/route.ts:164:9
     let folderUuid: string | null = folderUuidParam;
     let folderName = "files";
 
-    if (folderUuid === "home") {
+    if (false) {
       folderUuid = null;
       folderName = "home";

[NoCoverage] EqualityOperator
folders/download/[uuid]/route.ts:164:9
     let folderUuid: string | null = folderUuidParam;
     let folderName = "files";
 
-    if (folderUuid === "home") {
+    if (folderUuid !== "home") {
       folderUuid = null;
       folderName = "home";

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:167:12
     if (folderUuid === "home") {
       folderUuid = null;
       folderName = "home";
-    } else {
-      const folder = await db.folder.findUnique({
-        where: {
-          uuid: folderUuid,
-          ownerId: userId,
-        },
-        select: {
-          name: true,
-        },
-      });
-
-      if (!folder) {
-        return NextResponse.json(
-          { success: false, error: "Folder not found" },
-          { status: 404 },
-        );
-      }
-
-      folderName = folder.name;
-    }
+    } else {}
 
     const contents = await getFolderContents(folderUuid, userId);

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:168:49
       folderUuid = null;
       folderName = "home";
     } else {
-      const folder = await db.folder.findUnique({
-        where: {
-          uuid: folderUuid,
-          ownerId: userId,
-        },
-        select: {
-          name: true,
-        },
-      });
+      const folder = await db.folder.findUnique({});
 
       if (!folder) {

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:169:16
       folderName = "home";
     } else {
       const folder = await db.folder.findUnique({
-        where: {
-          uuid: folderUuid,
-          ownerId: userId,
-        },
+        where: {},
         select: {
           name: true,

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:173:17
           uuid: folderUuid,
           ownerId: userId,
         },
-        select: {
-          name: true,
-        },
+        select: {},
       });
 

[NoCoverage] BooleanLiteral
folders/download/[uuid]/route.ts:178:11
         },
       });
 
-      if (!folder) {
+      if (folder) {
         return NextResponse.json(
           { success: false, error: "Folder not found" },

[NoCoverage] ConditionalExpression
folders/download/[uuid]/route.ts:178:11
         },
       });
 
-      if (!folder) {
+      if (true) {
         return NextResponse.json(
           { success: false, error: "Folder not found" },

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:180:36
 
       if (!folder) {
         return NextResponse.json(
-          { success: false, error: "Folder not found" },
+          { success: false, error: "" },
           { status: 404 },
         );

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:190:32
 
     const contents = await getFolderContents(folderUuid, userId);
 
-    if (contents.length === 0) {
-      return NextResponse.json(
-        { success: false, error: "Folder is empty" },
-        { status: 400 },
-      );
-    }
+    if (contents.length === 0) {}
 
     const tempDir = await fs.mkdtemp(path.join(os.tmpdir(), "download-"));

[NoCoverage] EqualityOperator
folders/download/[uuid]/route.ts:190:9
 
     const contents = await getFolderContents(folderUuid, userId);
 
-    if (contents.length === 0) {
+    if (contents.length !== 0) {
       return NextResponse.json(
         { success: false, error: "Folder is empty" },

[NoCoverage] BooleanLiteral
folders/download/[uuid]/route.ts:192:20
 
     if (contents.length === 0) {
       return NextResponse.json(
-        { success: false, error: "Folder is empty" },
+        { success: true, error: "Folder is empty" },
         { status: 400 },
       );

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:192:34
 
     if (contents.length === 0) {
       return NextResponse.json(
-        { success: false, error: "Folder is empty" },
+        { success: false, error: "" },
         { status: 400 },
       );

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:197:61
       );
     }
 
-    const tempDir = await fs.mkdtemp(path.join(os.tmpdir(), "download-"));
+    const tempDir = await fs.mkdtemp(path.join(os.tmpdir(), ""));
 
     try {

[NoCoverage] MethodExpression
folders/download/[uuid]/route.ts:207:27
       );
 
       const archiveBuffer = await fs.readFile(archivePath);
-      const arrayBuffer = archiveBuffer.buffer.slice(
-        archiveBuffer.byteOffset,
-        archiveBuffer.byteOffset + archiveBuffer.byteLength,
-      );
+      const arrayBuffer = archiveBuffer.buffer;
 
       await unlink(archivePath);

[NoCoverage] ArithmeticOperator
folders/download/[uuid]/route.ts:209:9
       const archiveBuffer = await fs.readFile(archivePath);
       const arrayBuffer = archiveBuffer.buffer.slice(
         archiveBuffer.byteOffset,
-        archiveBuffer.byteOffset + archiveBuffer.byteLength,
+        archiveBuffer.byteOffset - archiveBuffer.byteLength,
       );
 

[NoCoverage] StringLiteral
folders/download/[uuid]/route.ts:215:43
       await unlink(archivePath);
       await fs.rmdir(tempDir);
 
-      const fileName = encodeURIComponent(`${folderName}.zip`);
+      const fileName = encodeURIComponent(``);
 
       return new NextResponse(arrayBuffer, {

[NoCoverage] ObjectLiteral
folders/download/[uuid]/route.ts:219:18
 
       return new NextResponse(arrayBuffer, {
         status: 200,
-        headers: {
-          "Content-Type": "application/zip",
-          "Content-Length": totalSize.toString(),
-          "Content-Disposition": `attachment; filename="${fileName}"`,
-        },
+        headers: {},
       });
     } catch (error) {

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:225:21
           "Content-Disposition": `attachment; filename="${fileName}"`,
         },
       });
-    } catch (error) {
-      try {
-        await fs.rm(tempDir, { recursive: true, force: true });
-      } catch {}
-
-      throw error;
-    }
+    } catch (error) {}
   } catch (error) {
     console.error("Folder download error:", error);

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:226:11
         },
       });
     } catch (error) {
-      try {
-        await fs.rm(tempDir, { recursive: true, force: true });
-      } catch {}
+      try {} catch {}
 
       throw error;

[NoCoverage] BooleanLiteral
folders/download/[uuid]/route.ts:227:43
       });
     } catch (error) {
       try {
-        await fs.rm(tempDir, { recursive: true, force: true });
+        await fs.rm(tempDir, { recursive: false, force: true });
       } catch {}
 

[NoCoverage] BooleanLiteral
folders/download/[uuid]/route.ts:227:56
       });
     } catch (error) {
       try {
-        await fs.rm(tempDir, { recursive: true, force: true });
+        await fs.rm(tempDir, { recursive: true, force: false });
       } catch {}
 

[NoCoverage] BlockStatement
folders/download/[uuid]/route.ts:232:19
 
       throw error;
     }
-  } catch (error) {
-    console.error("Folder download error:", error);
-    return NextResponse.json(
-      { success: false, error: "Failed to download folder" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
folders/download/[uuid]/route.ts:235:18
   } catch (error) {
     console.error("Folder download error:", error);
     return NextResponse.json(
-      { success: false, error: "Failed to download folder" },
+      { success: true, error: "Failed to download folder" },
       { status: 500 },
     );
