[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:25:20
 
     if (!userId)
       return NextResponse.json(
-        { success: false, error: "Unauthorized", path: [] },
+        { success: true, error: "Unauthorized", path: [] },
         { status: 401 },
       );

[NoCoverage] ObjectLiteral
folders/getPath/[uuid]/route.ts:26:9
     if (!userId)
       return NextResponse.json(
         { success: false, error: "Unauthorized", path: [] },
-        { status: 401 },
+        {},
       );
 

[NoCoverage] BlockStatement
folders/getPath/[uuid]/route.ts:33:32
 
     const homePath = { uuid: "home", name: "home" } as const;
 
-    if (folderUuid === "home") {
-      return NextResponse.json(
-        { success: true, error: null, path: [homePath] },
-        { status: 200 },
-      );
-    }
+    if (folderUuid === "home") {}
 
     let current = await db.folder.findFirst({

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:35:20
 
     if (folderUuid === "home") {
       return NextResponse.json(
-        { success: true, error: null, path: [homePath] },
+        { success: false, error: null, path: [homePath] },
         { status: 200 },
       );

[NoCoverage] ObjectLiteral
folders/getPath/[uuid]/route.ts:35:9
 
     if (folderUuid === "home") {
       return NextResponse.json(
-        { success: true, error: null, path: [homePath] },
+        {},
         { status: 200 },
       );

[NoCoverage] ObjectLiteral
folders/getPath/[uuid]/route.ts:36:9
     if (folderUuid === "home") {
       return NextResponse.json(
         { success: true, error: null, path: [homePath] },
-        { status: 200 },
+        {},
       );
     }

[NoCoverage] ObjectLiteral
folders/getPath/[uuid]/route.ts:40:45
       );
     }
 
-    let current = await db.folder.findFirst({
-      where: { uuid: folderUuid, ownerId: userId },
-      select: { uuid: true, name: true, parentUuid: true },
-    });
+    let current = await db.folder.findFirst({});
 
     if (!current)

[NoCoverage] ObjectLiteral
folders/getPath/[uuid]/route.ts:41:14
     }
 
     let current = await db.folder.findFirst({
-      where: { uuid: folderUuid, ownerId: userId },
+      where: {},
       select: { uuid: true, name: true, parentUuid: true },
     });

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:42:53
 
     let current = await db.folder.findFirst({
       where: { uuid: folderUuid, ownerId: userId },
-      select: { uuid: true, name: true, parentUuid: true },
+      select: { uuid: true, name: true, parentUuid: false },
     });
 

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:42:35
 
     let current = await db.folder.findFirst({
       where: { uuid: folderUuid, ownerId: userId },
-      select: { uuid: true, name: true, parentUuid: true },
+      select: { uuid: true, name: false, parentUuid: true },
     });
 

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:45:9
       select: { uuid: true, name: true, parentUuid: true },
     });
 
-    if (!current)
+    if (current)
       return NextResponse.json(
         { success: false, error: "Folder not found", path: [] },

[NoCoverage] ConditionalExpression
folders/getPath/[uuid]/route.ts:45:9
       select: { uuid: true, name: true, parentUuid: true },
     });
 
-    if (!current)
+    if (true)
       return NextResponse.json(
         { success: false, error: "Folder not found", path: [] },

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:47:20
 
     if (!current)
       return NextResponse.json(
-        { success: false, error: "Folder not found", path: [] },
+        { success: true, error: "Folder not found", path: [] },
         { status: 404 },
       );

[NoCoverage] BlockStatement
folders/getPath/[uuid]/route.ts:53:21
 
     const path: { uuid: string; name: string }[] = [];
 
-    while (current) {
-      path.push({ uuid: current.uuid, name: current.name });
-
-      if (!current.parentUuid) break;
-
-      current = await db.folder.findFirst({
-        where: { uuid: current.parentUuid, ownerId: userId },
-        select: { uuid: true, name: true, parentUuid: true },
-      });
-    }
+    while (current) {}
 
     path.push(homePath);

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:56:11
     while (current) {
       path.push({ uuid: current.uuid, name: current.name });
 
-      if (!current.parentUuid) break;
+      if (current.parentUuid) break;
 
       current = await db.folder.findFirst({

[NoCoverage] ConditionalExpression
folders/getPath/[uuid]/route.ts:56:11
     while (current) {
       path.push({ uuid: current.uuid, name: current.name });
 
-      if (!current.parentUuid) break;
+      if (false) break;
 
       current = await db.folder.findFirst({

[NoCoverage] ObjectLiteral
folders/getPath/[uuid]/route.ts:58:43
 
       if (!current.parentUuid) break;
 
-      current = await db.folder.findFirst({
-        where: { uuid: current.parentUuid, ownerId: userId },
-        select: { uuid: true, name: true, parentUuid: true },
-      });
+      current = await db.folder.findFirst({});
     }
 

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:60:25
 
       current = await db.folder.findFirst({
         where: { uuid: current.parentUuid, ownerId: userId },
-        select: { uuid: true, name: true, parentUuid: true },
+        select: { uuid: false, name: true, parentUuid: true },
       });
     }

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:60:37
 
       current = await db.folder.findFirst({
         where: { uuid: current.parentUuid, ownerId: userId },
-        select: { uuid: true, name: true, parentUuid: true },
+        select: { uuid: true, name: false, parentUuid: true },
       });
     }

[NoCoverage] MethodExpression
folders/getPath/[uuid]/route.ts:65:5
     }
 
     path.push(homePath);
-    path.reverse();
+    path;
 
     return NextResponse.json(

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:68:18
     path.reverse();
 
     return NextResponse.json(
-      { success: true, error: null, path },
+      { success: false, error: null, path },
       { status: 200 },
     );

[NoCoverage] BlockStatement
folders/getPath/[uuid]/route.ts:71:19
       { success: true, error: null, path },
       { status: 200 },
     );
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "Internal server error", path: [] },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
folders/getPath/[uuid]/route.ts:74:18
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Internal server error", path: [] },
+      { success: true, error: "Internal server error", path: [] },
       { status: 500 },
     );
