[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:22:12
   userId: number,
 ): Promise<void> {
   const childFolders = await db.folder.findMany({
-    where: { parentUuid: folderUuid, ownerId: userId },
+    where: {},
     select: { uuid: true },
   });

[NoCoverage] BooleanLiteral
folders/removeFolder/[uuid]/route.ts:23:21
 ): Promise<void> {
   const childFolders = await db.folder.findMany({
     where: { parentUuid: folderUuid, ownerId: userId },
-    select: { uuid: true },
+    select: { uuid: false },
   });
 

[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:23:13
 ): Promise<void> {
   const childFolders = await db.folder.findMany({
     where: { parentUuid: folderUuid, ownerId: userId },
-    select: { uuid: true },
+    select: {},
   });
 

[NoCoverage] BlockStatement
folders/removeFolder/[uuid]/route.ts:26:40
     select: { uuid: true },
   });
 
-  for (const { uuid } of childFolders) {
-    await deleteFolderRecursively(uuid, userId);
-  }
+  for (const { uuid } of childFolders) {}
 
   const files = await db.files.findMany({

[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:30:41
     await deleteFolderRecursively(uuid, userId);
   }
 
-  const files = await db.files.findMany({
-    where: { folderUuid, ownerId: userId },
-    select: { uuid: true },
-  });
+  const files = await db.files.findMany({});
 
   if (files.length > 0) {

[NoCoverage] BooleanLiteral
folders/removeFolder/[uuid]/route.ts:32:21
 
   const files = await db.files.findMany({
     where: { folderUuid, ownerId: userId },
-    select: { uuid: true },
+    select: { uuid: false },
   });
 

[NoCoverage] ConditionalExpression
folders/removeFolder/[uuid]/route.ts:35:7
     select: { uuid: true },
   });
 
-  if (files.length > 0) {
+  if (false) {
     const objectNames = files.map((f) => f.uuid);
     try {

[NoCoverage] EqualityOperator
folders/removeFolder/[uuid]/route.ts:35:7
     select: { uuid: true },
   });
 
-  if (files.length > 0) {
+  if (files.length >= 0) {
     const objectNames = files.map((f) => f.uuid);
     try {

[NoCoverage] ArrowFunction
folders/removeFolder/[uuid]/route.ts:36:35
   });
 
   if (files.length > 0) {
-    const objectNames = files.map((f) => f.uuid);
+    const objectNames = files.map(() => undefined);
     try {
       await minioClient.removeObjects(FILES_BUCKET, objectNames);

[NoCoverage] BlockStatement
folders/removeFolder/[uuid]/route.ts:37:9
 
   if (files.length > 0) {
     const objectNames = files.map((f) => f.uuid);
-    try {
-      await minioClient.removeObjects(FILES_BUCKET, objectNames);
-    } catch (err) {
+    try {} catch (err) {
       console.error("MinIO delete error:", err);
       throw err;

[NoCoverage] BlockStatement
folders/removeFolder/[uuid]/route.ts:39:19
     const objectNames = files.map((f) => f.uuid);
     try {
       await minioClient.removeObjects(FILES_BUCKET, objectNames);
-    } catch (err) {
-      console.error("MinIO delete error:", err);
-      throw err;
-    }
+    } catch (err) {}
 
     await db.files.deleteMany({

[NoCoverage] ConditionalExpression
folders/removeFolder/[uuid]/route.ts:70:9
 
     const { uuid: folderUuid } = await context.params;
 
-    if (!folderUuid)
+    if (false)
       return NextResponse.json(
         { success: false, error: "UUID is required" },

[NoCoverage] BooleanLiteral
folders/removeFolder/[uuid]/route.ts:70:9
 
     const { uuid: folderUuid } = await context.params;
 
-    if (!folderUuid)
+    if (folderUuid)
       return NextResponse.json(
         { success: false, error: "UUID is required" },

[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:76:47
         { status: 400 },
       );
 
-    const folder = await db.folder.findUnique({
-      where: { uuid: folderUuid, ownerId: userId },
-    });
+    const folder = await db.folder.findUnique({});
 
     if (!folder)

[NoCoverage] BooleanLiteral
folders/removeFolder/[uuid]/route.ts:80:9
       where: { uuid: folderUuid, ownerId: userId },
     });
 
-    if (!folder)
+    if (folder)
       return NextResponse.json(
         { success: false, error: "Folder not found" },

[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:88:30
 
     await deleteFolderRecursively(folderUuid, userId);
 
-    return NextResponse.json({ success: true, error: null }, { status: 200 });
+    return NextResponse.json({}, { status: 200 });
   } catch (error) {
     console.error(error);

[NoCoverage] BlockStatement
folders/removeFolder/[uuid]/route.ts:89:19
     await deleteFolderRecursively(folderUuid, userId);
 
     return NextResponse.json({ success: true, error: null }, { status: 200 });
-  } catch (error) {
-    console.error(error);
-    return NextResponse.json(
-      { success: false, error: "Failed to delete folder" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
folders/removeFolder/[uuid]/route.ts:92:18
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Failed to delete folder" },
+      { success: true, error: "Failed to delete folder" },
       { status: 500 },
     );

[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:92:7
   } catch (error) {
     console.error(error);
     return NextResponse.json(
-      { success: false, error: "Failed to delete folder" },
+      {},
       { status: 500 },
     );

[NoCoverage] ObjectLiteral
folders/removeFolder/[uuid]/route.ts:93:7
     console.error(error);
     return NextResponse.json(
       { success: false, error: "Failed to delete folder" },
-      { status: 500 },
+      {},
     );
   }
