[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:22:11
 ): Promise<void> {
   await db.folder.update({
     where: { uuid: folderUuid },
-    data: { private: isPrivate },
+    data: {},
   });
 

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:34:12
   });
 
   const subfolders = await db.folder.findMany({
-    where: {
-      parentUuid: folderUuid,
-      ownerId: userId,
-    },
+    where: {},
     select: {
       uuid: true,

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:38:13
       parentUuid: folderUuid,
       ownerId: userId,
     },
-    select: {
-      uuid: true,
-    },
+    select: {},
   });
 

[NoCoverage] BlockStatement
update-privacy/[uuid]/[privacy]/route.ts:43:39
     },
   });
 
-  for (const subfolder of subfolders) {
-    await updateFolderAndContentsPrivacy(subfolder.uuid, isPrivate, userId);
-  }
+  for (const subfolder of subfolders) {}
 }
 

[NoCoverage] StringLiteral
update-privacy/[uuid]/[privacy]/route.ts:58:34
 
     if (!userId)
       return NextResponse.json(
-        { success: false, error: "Unauthorized" },
+        { success: false, error: "" },
         { status: 401 },
       );

[NoCoverage] StringLiteral
update-privacy/[uuid]/[privacy]/route.ts:66:34
 
     if (!uuid)
       return NextResponse.json(
-        { success: false, error: "UUID is required" },
+        { success: false, error: "" },
         { status: 400 },
       );

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:72:47
 
     const isPrivate = privacy !== "1";
 
-    const folder = await db.folder.findUnique({
-      where: { uuid },
-      select: { ownerId: true },
-    });
+    const folder = await db.folder.findUnique({});
 
     if (!folder)

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:73:14
     const isPrivate = privacy !== "1";
 
     const folder = await db.folder.findUnique({
-      where: { uuid },
+      where: {},
       select: { ownerId: true },
     });

[NoCoverage] ObjectLiteral
update-privacy/[uuid]/[privacy]/route.ts:74:15
 
     const folder = await db.folder.findUnique({
       where: { uuid },
-      select: { ownerId: true },
+      select: {},
     });
 

[NoCoverage] EqualityOperator
update-privacy/[uuid]/[privacy]/route.ts:83:9
         { status: 404 },
       );
 
-    if (folder.ownerId !== userId)
+    if (folder.ownerId === userId)
       return NextResponse.json(
         { success: false, error: "Access denied" },

[NoCoverage] ConditionalExpression
update-privacy/[uuid]/[privacy]/route.ts:83:9
         { status: 404 },
       );
 
-    if (folder.ownerId !== userId)
+    if (true)
       return NextResponse.json(
         { success: false, error: "Access denied" },
