[NoCoverage] EqualityOperator
folders/upload/[uuid]/route.ts:29:24
   let currentParentUuid = parentUuid;
 
   for (const folderName of pathParts) {
-    if (!folderName || folderName.trim() === "") continue;
+    if (!folderName || folderName.trim() !== "") continue;
 
     const existingFolder = await db.folder.findFirst({

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:29:9
   let currentParentUuid = parentUuid;
 
   for (const folderName of pathParts) {
-    if (!folderName || folderName.trim() === "") continue;
+    if (folderName || folderName.trim() === "") continue;
 
     const existingFolder = await db.folder.findFirst({

[NoCoverage] ObjectLiteral
folders/upload/[uuid]/route.ts:31:54
   for (const folderName of pathParts) {
     if (!folderName || folderName.trim() === "") continue;
 
-    const existingFolder = await db.folder.findFirst({
-      where: {
-        name: folderName,
-        ownerId: userId,
-        parentUuid: currentParentUuid,
-      },
-      select: { uuid: true },
-    });
+    const existingFolder = await db.folder.findFirst({});
 
     if (existingFolder) {

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:37:23
         ownerId: userId,
         parentUuid: currentParentUuid,
       },
-      select: { uuid: true },
+      select: { uuid: false },
     });
 

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:40:9
       select: { uuid: true },
     });
 
-    if (existingFolder) {
+    if (true) {
       currentParentUuid = existingFolder.uuid;
     } else {

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:40:9
       select: { uuid: true },
     });
 
-    if (existingFolder) {
+    if (false) {
       currentParentUuid = existingFolder.uuid;
     } else {

[NoCoverage] BlockStatement
folders/upload/[uuid]/route.ts:42:12
 
     if (existingFolder) {
       currentParentUuid = existingFolder.uuid;
-    } else {
-      const folderUuid = uuidv4();
-      await db.folder.create({
-        data: {
-          uuid: folderUuid,
-          name: folderName,
-          size: 0,
-          ownerId: userId,
-          parentUuid: currentParentUuid,
-        },
-      });
-      currentParentUuid = folderUuid;
-    }
+    } else {}
   }
 

[NoCoverage] ObjectLiteral
folders/upload/[uuid]/route.ts:44:30
       currentParentUuid = existingFolder.uuid;
     } else {
       const folderUuid = uuidv4();
-      await db.folder.create({
-        data: {
-          uuid: folderUuid,
-          name: folderName,
-          size: 0,
-          ownerId: userId,
-          parentUuid: currentParentUuid,
-        },
-      });
+      await db.folder.create({});
       currentParentUuid = folderUuid;
     }

[NoCoverage] ObjectLiteral
folders/upload/[uuid]/route.ts:45:15
     } else {
       const folderUuid = uuidv4();
       await db.folder.create({
-        data: {
-          uuid: folderUuid,
-          name: folderName,
-          size: 0,
-          ownerId: userId,
-          parentUuid: currentParentUuid,
-        },
+        data: {},
       });
       currentParentUuid = folderUuid;

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:68:9
     const user = await getUserFromToken();
     const userId = user?.userId;
 
-    if (!userId) {
+    if (userId) {
       return NextResponse.json(
         { success: false, error: "Unauthorized" },

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:78:9
     const { uuid: targetFolderUuidParam } = await context.params;
 
     let targetFolderUuid: string | null = targetFolderUuidParam;
-    if (targetFolderUuid === "home") {
+    if (false) {
       targetFolderUuid = null;
     }

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:78:9
     const { uuid: targetFolderUuidParam } = await context.params;
 
     let targetFolderUuid: string | null = targetFolderUuidParam;
-    if (targetFolderUuid === "home") {
+    if (true) {
       targetFolderUuid = null;
     }

[NoCoverage] BlockStatement
folders/upload/[uuid]/route.ts:82:36
       targetFolderUuid = null;
     }
 
-    if (targetFolderUuid !== null) {
-      const folder = await db.folder.findUnique({
-        where: {
-          uuid: targetFolderUuid,
-          ownerId: userId,
-        },
-      });
-
-      if (!folder) {
-        return NextResponse.json(
-          { success: false, error: "Target folder not found" },
-          { status: 404 },
-        );
-      }
-    }
+    if (targetFolderUuid !== null) {}
 
     const formData = await request.formData();

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:82:9
       targetFolderUuid = null;
     }
 
-    if (targetFolderUuid !== null) {
+    if (false) {
       const folder = await db.folder.findUnique({
         where: {

[NoCoverage] BlockStatement
folders/upload/[uuid]/route.ts:90:20
         },
       });
 
-      if (!folder) {
-        return NextResponse.json(
-          { success: false, error: "Target folder not found" },
-          { status: 404 },
-        );
-      }
+      if (!folder) {}
     }
 

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:92:22
 
       if (!folder) {
         return NextResponse.json(
-          { success: false, error: "Target folder not found" },
+          { success: true, error: "Target folder not found" },
           { status: 404 },
         );

[NoCoverage] StringLiteral
folders/upload/[uuid]/route.ts:92:36
 
       if (!folder) {
         return NextResponse.json(
-          { success: false, error: "Target folder not found" },
+          { success: false, error: "" },
           { status: 404 },
         );

[NoCoverage] BlockStatement
folders/upload/[uuid]/route.ts:101:52
     const formData = await request.formData();
     const filesMap = new Map<string, { file: File; path: string }>();
 
-    for (const [key, value] of formData.entries()) {
-      if (key.startsWith("file_") && !key.endsWith("_path")) {
-        const index = key.replace("file_", "");
-        const pathKey = `file_${index}_path`;
-        const pathValue = formData.get(pathKey);
-
-        if (value instanceof File && typeof pathValue === "string") {
-          filesMap.set(index, {
-            file: value,
-            path: pathValue,
-          });
-        }
-      }
-    }
+    for (const [key, value] of formData.entries()) {}
 
     if (filesMap.size === 0) {

[NoCoverage] MethodExpression
folders/upload/[uuid]/route.ts:102:11
     const filesMap = new Map<string, { file: File; path: string }>();
 
     for (const [key, value] of formData.entries()) {
-      if (key.startsWith("file_") && !key.endsWith("_path")) {
+      if (key.endsWith("file_") && !key.endsWith("_path")) {
         const index = key.replace("file_", "");
         const pathKey = `file_${index}_path`;

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:102:11
     const filesMap = new Map<string, { file: File; path: string }>();
 
     for (const [key, value] of formData.entries()) {
-      if (key.startsWith("file_") && !key.endsWith("_path")) {
+      if (true) {
         const index = key.replace("file_", "");
         const pathKey = `file_${index}_path`;

[NoCoverage] StringLiteral
folders/upload/[uuid]/route.ts:103:35
 
     for (const [key, value] of formData.entries()) {
       if (key.startsWith("file_") && !key.endsWith("_path")) {
-        const index = key.replace("file_", "");
+        const index = key.replace("", "");
         const pathKey = `file_${index}_path`;
         const pathValue = formData.get(pathKey);

[NoCoverage] StringLiteral
folders/upload/[uuid]/route.ts:104:25
     for (const [key, value] of formData.entries()) {
       if (key.startsWith("file_") && !key.endsWith("_path")) {
         const index = key.replace("file_", "");
-        const pathKey = `file_${index}_path`;
+        const pathKey = ``;
         const pathValue = formData.get(pathKey);
 

[NoCoverage] LogicalOperator
folders/upload/[uuid]/route.ts:107:13
         const pathKey = `file_${index}_path`;
         const pathValue = formData.get(pathKey);
 
-        if (value instanceof File && typeof pathValue === "string") {
+        if (value instanceof File || typeof pathValue === "string") {
           filesMap.set(index, {
             file: value,

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:107:38
         const pathKey = `file_${index}_path`;
         const pathValue = formData.get(pathKey);
 
-        if (value instanceof File && typeof pathValue === "string") {
+        if (value instanceof File && true) {
           filesMap.set(index, {
             file: value,

[NoCoverage] EqualityOperator
folders/upload/[uuid]/route.ts:116:9
       }
     }
 
-    if (filesMap.size === 0) {
+    if (filesMap.size !== 0) {
       return NextResponse.json(
         { success: false, error: "No files provided" },

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:116:9
       }
     }
 
-    if (filesMap.size === 0) {
+    if (false) {
       return NextResponse.json(
         { success: false, error: "No files provided" },

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:118:20
 
     if (filesMap.size === 0) {
       return NextResponse.json(
-        { success: false, error: "No files provided" },
+        { success: true, error: "No files provided" },
         { status: 400 },
       );

[NoCoverage] ObjectLiteral
folders/upload/[uuid]/route.ts:119:9
     if (filesMap.size === 0) {
       return NextResponse.json(
         { success: false, error: "No files provided" },
-        { status: 400 },
+        {},
       );
     }

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:127:63
     const createdFolders = new Set<string>();
 
     for (const { file, path: relativePath } of filesMap.values()) {
-      const pathParts = relativePath.split("/").filter((p) => p.trim() !== "");
+      const pathParts = relativePath.split("/").filter((p) => true);
       const fileName = pathParts.pop();
 

[NoCoverage] MethodExpression
folders/upload/[uuid]/route.ts:127:63
     const createdFolders = new Set<string>();
 
     for (const { file, path: relativePath } of filesMap.values()) {
-      const pathParts = relativePath.split("/").filter((p) => p.trim() !== "");
+      const pathParts = relativePath.split("/").filter((p) => p !== "");
       const fileName = pathParts.pop();
 

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:130:11
       const pathParts = relativePath.split("/").filter((p) => p.trim() !== "");
       const fileName = pathParts.pop();
 
-      if (!fileName) continue;
+      if (false) continue;
 
       let fileFolderUuid = targetFolderUuid;

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:130:11
       const pathParts = relativePath.split("/").filter((p) => p.trim() !== "");
       const fileName = pathParts.pop();
 
-      if (!fileName) continue;
+      if (true) continue;
 
       let fileFolderUuid = targetFolderUuid;

[NoCoverage] EqualityOperator
folders/upload/[uuid]/route.ts:133:11
       if (!fileName) continue;
 
       let fileFolderUuid = targetFolderUuid;
-      if (pathParts.length > 0) {
+      if (pathParts.length >= 0) {
         fileFolderUuid = await ensureFolderPath(
           pathParts,

[NoCoverage] EqualityOperator
folders/upload/[uuid]/route.ts:133:11
       if (!fileName) continue;
 
       let fileFolderUuid = targetFolderUuid;
-      if (pathParts.length > 0) {
+      if (pathParts.length <= 0) {
         fileFolderUuid = await ensureFolderPath(
           pathParts,

[NoCoverage] ArrowFunction
folders/upload/[uuid]/route.ts:139:27
           userId,
           targetFolderUuid,
         );
-        pathParts.forEach((part) => createdFolders.add(part));
+        pathParts.forEach(() => undefined);
       }
 

[NoCoverage] ObjectLiteral
folders/upload/[uuid]/route.ts:145:78
       const fileUuid = uuidv4();
       const buffer = Buffer.from(await file.arrayBuffer());
 
-      await minioClient.putObject(FILES_BUCKET, fileUuid, buffer, file.size, {
-        "Content-Type": file.type || "application/octet-stream",
-      });
+      await minioClient.putObject(FILES_BUCKET, fileUuid, buffer, file.size, {});
 
       await db.files.create({

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:146:25
       const buffer = Buffer.from(await file.arrayBuffer());
 
       await minioClient.putObject(FILES_BUCKET, fileUuid, buffer, file.size, {
-        "Content-Type": file.type || "application/octet-stream",
+        "Content-Type": true,
       });
 

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:146:25
       const buffer = Buffer.from(await file.arrayBuffer());
 
       await minioClient.putObject(FILES_BUCKET, fileUuid, buffer, file.size, {
-        "Content-Type": file.type || "application/octet-stream",
+        "Content-Type": false,
       });
 

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:153:17
         data: {
           uuid: fileUuid,
           name: fileName,
-          type: file.type || "application/octet-stream",
+          type: false,
           size: file.size,
           ownerId: userId,

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:153:17
         data: {
           uuid: fileUuid,
           name: fileName,
-          type: file.type || "application/octet-stream",
+          type: true,
           size: file.size,
           ownerId: userId,

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:157:20
           size: file.size,
           ownerId: userId,
           folderUuid: fileFolderUuid,
-          private: true,
+          private: false,
         },
       });

[NoCoverage] UpdateOperator
folders/upload/[uuid]/route.ts:161:7
         },
       });
 
-      filesCount++;
+      filesCount--;
     }
 

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:170:61
       {
         success: true,
         error: null,
-        message: `Successfully uploaded ${filesCount} file${filesCount !== 1 ? "s" : ""} and created ${foldersCount} folder${foldersCount !== 1 ? "s" : ""}`,
+        message: `Successfully uploaded ${filesCount} file${true ? "s" : ""} and created ${foldersCount} folder${foldersCount !== 1 ? "s" : ""}`,
         filesCount,
         foldersCount,

[NoCoverage] ConditionalExpression
folders/upload/[uuid]/route.ts:170:126
       {
         success: true,
         error: null,
-        message: `Successfully uploaded ${filesCount} file${filesCount !== 1 ? "s" : ""} and created ${foldersCount} folder${foldersCount !== 1 ? "s" : ""}`,
+        message: `Successfully uploaded ${filesCount} file${filesCount !== 1 ? "s" : ""} and created ${foldersCount} folder${true ? "s" : ""}`,
         filesCount,
         foldersCount,

[NoCoverage] BlockStatement
folders/upload/[uuid]/route.ts:176:19
       },
       { status: 200 },
     );
-  } catch (error) {
-    console.error("Folder upload error:", error);
-    return NextResponse.json(
-      { success: false, error: "Failed to upload folder" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
folders/upload/[uuid]/route.ts:179:18
   } catch (error) {
     console.error("Folder upload error:", error);
     return NextResponse.json(
-      { success: false, error: "Failed to upload folder" },
+      { success: true, error: "Failed to upload folder" },
       { status: 500 },
     );
