[NoCoverage] BlockStatement
app/api/minio-test/route.ts:5:7
 import { minioClient } from "@/lib/minio";
 
 export async function GET() {
-  try {
-    // 1 — проверяем подключение: список бакетов
-    const buckets = await minioClient.listBuckets();
-
-    // 2 — проверяем конкретный bucket
-    const bucket = process.env.MINIO_BUCKET!;
-    const stream = minioClient.listObjects(bucket, "", true);
-
-    const files: string[] = [];
-    for await (const obj of stream) {
-      files.push(obj.name);
-    }
-
-    return NextResponse.json({
-      status: "ok",
-      buckets,
-      bucket,
-      files,
-    });
-  } catch (error) {
+  try {} catch (error) {
     // Уточняем тип как unknown и проверяем
     const message =

[NoCoverage] BooleanLiteral
app/api/minio-test/route.ts:11:56
 
     // 2 — проверяем конкретный bucket
     const bucket = process.env.MINIO_BUCKET!;
-    const stream = minioClient.listObjects(bucket, "", true);
+    const stream = minioClient.listObjects(bucket, "", false);
 
     const files: string[] = [];

[NoCoverage] BlockStatement
app/api/minio-test/route.ts:14:37
     const stream = minioClient.listObjects(bucket, "", true);
 
     const files: string[] = [];
-    for await (const obj of stream) {
-      files.push(obj.name);
-    }
+    for await (const obj of stream) {}
 
     return NextResponse.json({

[NoCoverage] BlockStatement
app/api/minio-test/route.ts:24:19
       bucket,
       files,
     });
-  } catch (error) {
-    // Уточняем тип как unknown и проверяем
-    const message =
-      error instanceof Error ? error.message : "Unknown error occurred";
-
-    return NextResponse.json(
-      {
-        status: "error",
-        message,
-      },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
