[Survived] ObjectLiteral
api/user/remove/route.ts:18:49
   folderUuid: string,
   userId: number,
 ): Promise<void> {
-  const childFolders = await db.folder.findMany({
-    where: { parentUuid: folderUuid, ownerId: userId },
-    select: { uuid: true },
-  });
+  const childFolders = await db.folder.findMany({});
 
   for (const { uuid } of childFolders) {

[Killed] BlockStatement
api/user/remove/route.ts:32:25
     select: { uuid: true },
   });
 
-  if (files.length > 0) {
-    const objectNames = files.map((f) => f.uuid);
-    try {
-      await minioClient.removeObjects(FILES_BUCKET, objectNames);
-    } catch (err) {
-      console.error("MinIO delete error:", err);
-    }
-
-    await db.files.deleteMany({
-      where: { folderUuid, ownerId: userId },
-    });
-  }
+  if (files.length > 0) {}
 
   await db.folder.delete({
killedBy: User API Tests DELETE /api/user/remove should recursively delete folders and files
statusReason: expected "vi.fn()" to be called with arguments: [ 'test-files-bucket', …(1) ]

Number of calls: 0

[Survived] BlockStatement
api/user/remove/route.ts:36:19
     const objectNames = files.map((f) => f.uuid);
     try {
       await minioClient.removeObjects(FILES_BUCKET, objectNames);
-    } catch (err) {
-      console.error("MinIO delete error:", err);
-    }
+    } catch (err) {}
 
     await db.files.deleteMany({

[Survived] ObjectLiteral
api/user/remove/route.ts:40:31
       console.error("MinIO delete error:", err);
     }
 
-    await db.files.deleteMany({
-      where: { folderUuid, ownerId: userId },
-    });
+    await db.files.deleteMany({});
   }
 

[Survived] ObjectLiteral
api/user/remove/route.ts:46:12
   }
 
   await db.folder.delete({
-    where: { uuid: folderUuid },
+    where: {},
   });
 }

[Survived] ObjectLiteral
api/user/remove/route.ts:64:54
       );
     }
 
-    const topLevelFolders = await db.folder.findMany({
-      where: {
-        ownerId: userId,
-        parentUuid: null,
-      },
-      select: { uuid: true },
-    });
+    const topLevelFolders = await db.folder.findMany({});
 
     for (const { uuid } of topLevelFolders) {

[Killed] BlockStatement
api/user/remove/route.ts:72:45
       select: { uuid: true },
     });
 
-    for (const { uuid } of topLevelFolders) {
-      await deleteFolderRecursively(uuid, userId);
-    }
+    for (const { uuid } of topLevelFolders) {}
 
     const orphanFiles = await db.files.findMany({
killedBy: User API Tests DELETE /api/user/remove should recursively delete folders and files
statusReason: expected "vi.fn()" to be called with arguments: [ 'test-files-bucket', …(1) ]

Number of calls: 0

[Survived] ObjectLiteral
api/user/remove/route.ts:76:49
       await deleteFolderRecursively(uuid, userId);
     }
 
-    const orphanFiles = await db.files.findMany({
-      where: {
-        ownerId: userId,
-        folderUuid: null,
-      },
-      select: { uuid: true },
-    });
+    const orphanFiles = await db.files.findMany({});
 
     if (orphanFiles.length > 0) {

[Survived] EqualityOperator
api/user/remove/route.ts:84:9
       select: { uuid: true },
     });
 
-    if (orphanFiles.length > 0) {
+    if (orphanFiles.length >= 0) {
       const objectNames = orphanFiles.map((f) => f.uuid);
       try {

[Survived] EqualityOperator
api/user/remove/route.ts:84:9
       select: { uuid: true },
     });
 
-    if (orphanFiles.length > 0) {
+    if (orphanFiles.length <= 0) {
       const objectNames = orphanFiles.map((f) => f.uuid);
       try {

[Survived] ArrowFunction
api/user/remove/route.ts:85:43
     });
 
     if (orphanFiles.length > 0) {
-      const objectNames = orphanFiles.map((f) => f.uuid);
+      const objectNames = orphanFiles.map(() => undefined);
       try {
         await minioClient.removeObjects(FILES_BUCKET, objectNames);

[Survived] BlockStatement
api/user/remove/route.ts:86:11
 
     if (orphanFiles.length > 0) {
       const objectNames = orphanFiles.map((f) => f.uuid);
-      try {
-        await minioClient.removeObjects(FILES_BUCKET, objectNames);
-      } catch (err) {
+      try {} catch (err) {
         console.error("MinIO delete error:", err);
       }

[Survived] StringLiteral
api/user/remove/route.ts:89:23
       try {
         await minioClient.removeObjects(FILES_BUCKET, objectNames);
       } catch (err) {
-        console.error("MinIO delete error:", err);
+        console.error("", err);
       }
 

[Survived] ObjectLiteral
api/user/remove/route.ts:100:26
       });
     }
 
-    await db.user.delete({
-      where: { id: userId },
-    });
+    await db.user.delete({});
 
     const response = NextResponse.json(

[Killed] ObjectLiteral
api/user/remove/route.ts:113:39
       { status: 200 },
     );
 
-    response.cookies.set("token", "", {
-      httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
-      sameSite: "lax",
-      path: "/",
-      maxAge: 0,
-    });
+    response.cookies.set("token", "", {});
 
     return response;
killedBy: User API Tests DELETE /api/user/remove should delete user and all associated data successfully
statusReason: expected 'token=; Path=/' to contain 'Max-Age=0'

[Killed] StringLiteral
api/user/remove/route.ts:113:26
       { status: 200 },
     );
 
-    response.cookies.set("token", "", {
+    response.cookies.set("", "", {
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
killedBy: User API Tests DELETE /api/user/remove should delete user and all associated data successfully
statusReason: expected '=; Path=/; Max-Age=0; HttpOnly; SameS…' to contain 'token=;'

[Survived] BooleanLiteral
api/user/remove/route.ts:114:17
     );
 
     response.cookies.set("token", "", {
-      httpOnly: true,
+      httpOnly: false,
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",

[Survived] ConditionalExpression
api/user/remove/route.ts:115:15
 
     response.cookies.set("token", "", {
       httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
+      secure: true,
       sameSite: "lax",
       path: "/",

[Survived] ConditionalExpression
api/user/remove/route.ts:115:15
 
     response.cookies.set("token", "", {
       httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
+      secure: false,
       sameSite: "lax",
       path: "/",

[Survived] StringLiteral
api/user/remove/route.ts:116:17
     response.cookies.set("token", "", {
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
-      sameSite: "lax",
+      sameSite: "",
       path: "/",
       maxAge: 0,

[Killed] BlockStatement
api/user/remove/route.ts:122:19
     });
 
     return response;
-  } catch (error) {
-    console.error("Error removing user:", error);
-
-    if (
-      error instanceof Error &&
-      error.message.includes("Record to delete does not exist")
-    ) {
-      return NextResponse.json(
-        { success: false, error: "User not found" },
-        { status: 404 },
-      );
-    }
-
-    return NextResponse.json(
-      { success: false, error: "Failed to remove user account" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: User API Tests DELETE /api/user/remove should return 404 when user does not exist
statusReason: Cannot read properties of undefined (reading 'json')

[Killed] ConditionalExpression
api/user/remove/route.ts:126:7
     console.error("Error removing user:", error);
 
     if (
-      error instanceof Error &&
-      error.message.includes("Record to delete does not exist")
+      true
     ) {
       return NextResponse.json(
killedBy: User API Tests DELETE /api/user/remove should handle other server errors
statusReason: expected 404 to be 500 // Object.is equality

[Killed] LogicalOperator
api/user/remove/route.ts:126:7
     console.error("Error removing user:", error);
 
     if (
-      error instanceof Error &&
-      error.message.includes("Record to delete does not exist")
+      error instanceof Error || error.message.includes("Record to delete does not exist")
     ) {
       return NextResponse.json(
killedBy: User API Tests DELETE /api/user/remove should handle other server errors
statusReason: expected 404 to be 500 // Object.is equality

[NoCoverage] BlockStatement
api/user/remove/route.ts:128:7
     if (
       error instanceof Error &&
       error.message.includes("Record to delete does not exist")
-    ) {
-      return NextResponse.json(
-        { success: false, error: "User not found" },
-        { status: 404 },
-      );
-    }
+    ) {}
 
     return NextResponse.json(

[NoCoverage] BooleanLiteral
api/user/remove/route.ts:130:20
       error.message.includes("Record to delete does not exist")
     ) {
       return NextResponse.json(
-        { success: false, error: "User not found" },
+        { success: true, error: "User not found" },
         { status: 404 },
       );

[NoCoverage] ObjectLiteral
api/user/remove/route.ts:130:9
       error.message.includes("Record to delete does not exist")
     ) {
       return NextResponse.json(
-        { success: false, error: "User not found" },
+        {},
         { status: 404 },
       );

[Killed] BooleanLiteral
api/user/remove/route.ts:136:18
     }
 
     return NextResponse.json(
-      { success: false, error: "Failed to remove user account" },
+      { success: true, error: "Failed to remove user account" },
       { status: 500 },
     );
killedBy: User API Tests DELETE /api/user/remove should handle other server errors
statusReason: expected { success: true, …(1) } to deeply equal { success: false, …(1) }
