[Killed] BlockStatement
api/user/getData/route.ts:16:7
 export async function GET(
   request: NextRequest,
 ): Promise<NextResponse<UserResponse>> {
-  try {
-    const user = await getUserFromToken();
-
-    if (!user) {
-      return NextResponse.json(
-        {
-          success: false,
-          error: "Invalid token",
-          user: null,
-        },
-        { status: 401 },
-      );
-    }
-
-    return NextResponse.json(
-      {
-        success: true,
-        error: null,
-        user,
-      },
-      { status: 200 },
-    );
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching user data:", error);
     return NextResponse.json(
killedBy: User API Tests GET /api/user/getData should return user data when authenticated
statusReason: Cannot read properties of undefined (reading 'json')

[Killed] BlockStatement
api/user/getData/route.ts:19:16
   try {
     const user = await getUserFromToken();
 
-    if (!user) {
-      return NextResponse.json(
-        {
-          success: false,
-          error: "Invalid token",
-          user: null,
-        },
-        { status: 401 },
-      );
-    }
+    if (!user) {}
 
     return NextResponse.json(
killedBy: User API Tests GET /api/user/getData should return 401 when user is not authenticated
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ObjectLiteral
api/user/getData/route.ts:21:9
 
     if (!user) {
       return NextResponse.json(
-        {
-          success: false,
-          error: "Invalid token",
-          user: null,
-        },
+        {},
         { status: 401 },
       );
killedBy: User API Tests GET /api/user/getData should return 401 when user is not authenticated
statusReason: expected {} to deeply equal { success: false, …(2) }

[Killed] BlockStatement
api/user/getData/route.ts:38:19
       },
       { status: 200 },
     );
-  } catch (error) {
-    console.error("Error fetching user data:", error);
-    return NextResponse.json(
-      {
-        success: false,
-        error: "Internal server error",
-        user: null,
-      },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: User API Tests GET /api/user/getData should handle server errors
statusReason: Cannot read properties of undefined (reading 'json')

[Killed] ObjectLiteral
api/user/getData/route.ts:46:7
         error: "Internal server error",
         user: null,
       },
-      { status: 500 },
+      {},
     );
   }
killedBy: User API Tests GET /api/user/getData should handle server errors
statusReason: expected 200 to be 500 // Object.is equality
