[Survived] EqualityOperator
api/user/logout/route.ts:24:15
 
     response.cookies.set("token", "", {
       httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
+      secure: process.env.NODE_ENV !== "production",
       sameSite: "lax",
       path: "/",

[Killed] StringLiteral
api/user/logout/route.ts:30:37
       maxAge: 0,
     });
 
-    response.cookies.set("session", "", {
+    response.cookies.set("session", "Stryker was here!", {
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
killedBy: User API Tests POST /api/user/logout should logout successfully and clear cookies
statusReason: expected 'token=; Path=/; Max-Age=0; HttpOnly; …' to contain 'session=;'

[Killed] StringLiteral
api/user/logout/route.ts:30:26
       maxAge: 0,
     });
 
-    response.cookies.set("session", "", {
+    response.cookies.set("", "", {
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
killedBy: User API Tests POST /api/user/logout should logout successfully and clear cookies
statusReason: expected 'token=; Path=/; Max-Age=0; HttpOnly; …' to contain 'session=;'

[Survived] BooleanLiteral
api/user/logout/route.ts:31:17
     });
 
     response.cookies.set("session", "", {
-      httpOnly: true,
+      httpOnly: false,
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",

[Survived] StringLiteral
api/user/logout/route.ts:34:13
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",
-      path: "/",
+      path: "",
       maxAge: 0,
     });

[Killed] BlockStatement
api/user/logout/route.ts:39:19
     });
 
     return response;
-  } catch (error) {
-    console.error("Error during logout:", error);
-
-    const errorResponse = NextResponse.json(
-      {
-        success: false,
-        error: "Error during logout process",
-      },
-      { status: 500 },
-    );
-
-    errorResponse.cookies.set("token", "", {
-      httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
-      sameSite: "lax",
-      path: "/",
-      maxAge: 0,
-    });
-
-    return errorResponse;
-  }
+  } catch (error) {}
 }
 
killedBy: User API Tests POST /api/user/logout should still clear cookies even on error
statusReason: Cannot read properties of undefined (reading 'json')

[Survived] StringLiteral
api/user/logout/route.ts:40:19
 
     return response;
   } catch (error) {
-    console.error("Error during logout:", error);
+    console.error("", error);
 
     const errorResponse = NextResponse.json(

[Killed] StringLiteral
api/user/logout/route.ts:45:16
     const errorResponse = NextResponse.json(
       {
         success: false,
-        error: "Error during logout process",
+        error: "",
       },
       { status: 500 },
killedBy: User API Tests POST /api/user/logout should still clear cookies even on error
statusReason: expected { success: false, error: '' } to deeply equal { success: false, …(1) }

[Killed] StringLiteral
api/user/logout/route.ts:50:40
       { status: 500 },
     );
 
-    errorResponse.cookies.set("token", "", {
+    errorResponse.cookies.set("token", "Stryker was here!", {
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
killedBy: User API Tests POST /api/user/logout should still clear cookies even on error
statusReason: expected 'token=Stryker%20was%20here!; Path=/; …' to contain 'token=;'

[Survived] ObjectLiteral
api/user/logout/route.ts:50:44
       { status: 500 },
     );
 
-    errorResponse.cookies.set("token", "", {
-      httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
-      sameSite: "lax",
-      path: "/",
-      maxAge: 0,
-    });
+    errorResponse.cookies.set("token", "", {});
 
     return errorResponse;

[Survived] BooleanLiteral
api/user/logout/route.ts:51:17
     );
 
     errorResponse.cookies.set("token", "", {
-      httpOnly: true,
+      httpOnly: false,
       secure: process.env.NODE_ENV === "production",
       sameSite: "lax",
