[Killed] BooleanLiteral
api/user/register/route.ts:26:9
     const body: RegisterRequest = await req.json();
     const { uniqName, password, email } = body;
 
-    if (!uniqName || !password) {
+    if (uniqName || !password) {
       return NextResponse.json(
         { error: "Username and password required" },
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
api/user/register/route.ts:26:9
     const body: RegisterRequest = await req.json();
     const { uniqName, password, email } = body;
 
-    if (!uniqName || !password) {
+    if (true) {
       return NextResponse.json(
         { error: "Username and password required" },
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
api/user/register/route.ts:28:9
 
     if (!uniqName || !password) {
       return NextResponse.json(
-        { error: "Username and password required" },
+        {},
         { status: 400 },
       );
killedBy: User API Tests POST /api/user/register should return 400 when username or password is missing
statusReason: expected undefined to be 'Username and password required' // Object.is equality

[Killed] StringLiteral
api/user/register/route.ts:28:18
 
     if (!uniqName || !password) {
       return NextResponse.json(
-        { error: "Username and password required" },
+        { error: "" },
         { status: 400 },
       );
killedBy: User API Tests POST /api/user/register should return 400 when username or password is missing
statusReason: expected '' to be 'Username and password required' // Object.is equality

[Killed] BooleanLiteral
api/user/register/route.ts:35:21
 
     const existingUser = await db.user.findUnique({
       where: { uniqName },
-      select: { id: true },
+      select: { id: false },
     });
 
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
api/user/register/route.ts:38:23
       select: { id: true },
     });
 
-    if (existingUser) {
-      return NextResponse.json(
-        { error: "Username already taken" },
-        { status: 409 },
-      );
-    }
+    if (existingUser) {}
 
     const hashedPassword = await bcrypt.hash(password, 10);
killedBy: User API Tests POST /api/user/register should return 409 when username already exists
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ObjectLiteral
api/user/register/route.ts:40:9
 
     if (existingUser) {
       return NextResponse.json(
-        { error: "Username already taken" },
+        {},
         { status: 409 },
       );
killedBy: User API Tests POST /api/user/register should return 409 when username already exists
statusReason: expected undefined to be 'Username already taken' // Object.is equality

[Killed] ObjectLiteral
api/user/register/route.ts:47:39
 
     const hashedPassword = await bcrypt.hash(password, 10);
 
-    const user = await db.user.create({
-      data: {
-        uniqName,
-        hashPassword: hashedPassword,
-        email,
-      },
-    });
+    const user = await db.user.create({});
 
     console.log("user created:", user.id);
killedBy: Auth Integration Flow should return 200 successfully log in
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
api/user/register/route.ts:61:19
       message: "User created successfully",
       userId: user.id,
     });
-  } catch (error) {
-    console.error("error in /api/user/register:", error);
-    return NextResponse.json(
-      { error: "Internal server error" },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: User API Tests POST /api/user/register should handle server errors
statusReason: Cannot read properties of undefined (reading 'json')

[Survived] StringLiteral
api/user/register/route.ts:62:19
       userId: user.id,
     });
   } catch (error) {
-    console.error("error in /api/user/register:", error);
+    console.error("", error);
     return NextResponse.json(
       { error: "Internal server error" },

[Killed] ObjectLiteral
api/user/register/route.ts:64:7
   } catch (error) {
     console.error("error in /api/user/register:", error);
     return NextResponse.json(
-      { error: "Internal server error" },
+      {},
       { status: 500 },
     );
killedBy: User API Tests POST /api/user/register should handle server errors
statusReason: expected undefined to be 'Internal server error' // Object.is equality

[Killed] ObjectLiteral
api/user/register/route.ts:65:7
     console.error("error in /api/user/register:", error);
     return NextResponse.json(
       { error: "Internal server error" },
-      { status: 500 },
+      {},
     );
   }
killedBy: User API Tests POST /api/user/register should handle server errors
statusReason: expected 200 to be 500 // Object.is equality
